{
  "database_info": {
    "title": "US Transparency Laws - Complete Statutory Text Database",
    "description": "Actual statutory text extracted from official government sources for all US transparency laws",
    "version": "1.0.0",
    "created_date": "2025-01-23",
    "purpose": "Supabase database backend for transparency website tools",
    "extraction_method": "Direct from official .gov sources",
    "total_jurisdictions": 51
  },
  "jurisdictions": {
    "california": {
      "jurisdiction_info": {
        "jurisdiction_code": "CA",
        "jurisdiction_name": "California",
        "jurisdiction_type": "state"
      },
      "statute_citation": "California Government Code § 7922.535",
      "official_source_url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=GOV&sectionNum=7922.535",
      "current_effective_date": "January 1, 2025",
      "recent_amendments": "Stats. 2024, Ch. 161, Sec. 1",
      "statutory_text": {
        "section_7922_535": {
          "title": "Response Time Requirements",
          "text": "(a) Each agency must: - Determine within 10 days if a records request seeks disclosable public records - Promptly notify the requester of the determination and reasons - State the estimated date/time records will be available if disclosable (b) In 'unusual circumstances', the time limit may be extended by: - Written notice from agency head/designee - Stating reasons for extension - No extension can exceed 14 days (c) 'Unusual circumstances' include: 1. Searching records across multiple facilities 2. Examining voluminous records in a single request 3. Consulting with other agencies/components 4. Compiling/programming data 5. Searching records during a state of emergency affecting agency response"
        }
      }
    },
    "texas": {
      "jurisdiction_info": {
        "jurisdiction_code": "TX",
        "jurisdiction_name": "Texas",
        "jurisdiction_type": "state"
      },
      "statute_citation": "Texas Government Code Chapter 552",
      "official_source_url": "https://statutes.capitol.texas.gov/Docs/GV/htm/GV.552.htm",
      "current_effective_date": "Current through 2024 Legislative Session",
      "recent_amendments": "No major amendments noted 2022-2024",
      "statutory_text": {
        "section_552_001": {
          "title": "Policy; Construction",
          "text": "Each person is entitled, unless otherwise expressly provided by law, at all times to complete information about the affairs of government and the official acts of public officials and employees. This chapter shall be liberally construed in favor of granting a request for information."
        },
        "section_552_002": {
          "title": "Definition of Public Information",
          "text": "Public information means information that is written, produced, collected, assembled, or maintained under a law or ordinance or in connection with the transaction of official business: (1) by a governmental body; (2) for a governmental body and the governmental body owns the information or has a right of access to it; or (3) by an officer or employee of a governmental body in the officer's or employee's official capacity or under color of office or employment."
        }
      }
    },
    "new_york": {
      "jurisdiction_info": {
        "jurisdiction_code": "NY",
        "jurisdiction_name": "New York",
        "jurisdiction_type": "state"
      },
      "statute_citation": "New York Public Officers Law § 89",
      "official_source_url": "https://www.nysenate.gov/legislation/laws/PBO/89",
      "current_effective_date": "Current through 2024",
      "recent_amendments": "S2520A pending - major changes to response times effective January 1, 2026",
      "statutory_text": {
        "section_89_3_a": {
          "title": "Response Time Requirements",
          "text": "Agencies must respond within 5 business days by: - Making the record available - Denying the request in writing, or - Providing a written acknowledgement with an approximate date when the request will be granted/denied. If circumstances prevent disclosure within 20 business days, the agency must: - State in writing the reason for the delay - Provide a 'date certain within a reasonable period' when the request will be granted"
        }
      }
    },
    "florida": {
      "jurisdiction_info": {
        "jurisdiction_code": "FL",
        "jurisdiction_name": "Florida",
        "jurisdiction_type": "state"
      },
      "statute_citation": "Florida Statute 119.07",
      "official_source_url": "https://www.flsenate.gov/Laws/Statutes/2024/119.07",
      "current_effective_date": "2024 Florida Statutes",
      "recent_amendments": "No major amendments noted 2022-2024",
      "statutory_text": {
        "section_119_07": {
          "title": "Inspection and copying of records",
          "text": "Custodians must permit the record to be inspected and copied by any person desiring to do so, at any reasonable time, under reasonable conditions. Custodians must: - Acknowledge requests promptly - Respond in good faith - Make reasonable efforts to determine if record exists - Identify record's location if it exists. If part of a record is exempt, the custodian must: - Redact only the exempt portion - Produce the remainder of the record - State the specific exemption basis if requested"
        }
      }
    },
    "illinois": {
      "jurisdiction_info": {
        "jurisdiction_code": "IL",
        "jurisdiction_name": "Illinois",
        "jurisdiction_type": "state"
      },
      "statute_citation": "5 ILCS 140/3",
      "official_source_url": "https://www.ilga.gov/legislation/ilcs/ilcs3.asp?ActID=85&ChapterID=2",
      "current_effective_date": "Current through 2024 Legislative Session",
      "recent_amendments": "SB1445 (2023) - Enhanced disclosure requirements",
      "statutory_text": {
        "section_140_3": {
          "title": "Requests for information",
          "text": "(d) Each public body shall promptly, either comply with or deny a request for public records within 5 business days after its receipt of the request. Failure to respond within 5 business days is considered a denial. (e) The time for response may be extended by the public body for up to 5 additional business days for reasons including: - Records stored at other locations - Requires collecting substantial number of records - Requires extensive search - Records not located in routine search - Records need evaluation for potential exemptions - Compliance would unduly burden operations - Need for consultation with other bodies (f) When additional time is required, the public body must within 5 business days after receipt of the request, notify the person making the request of the reasons for the extension and the date by which the response will be forthcoming."
        }
      }
    },
    "ohio": {
      "jurisdiction_info": {
        "jurisdiction_code": "OH",
        "jurisdiction_name": "Ohio",
        "jurisdiction_type": "state"
      },
      "statute_citation": "Ohio Revised Code § 149.43",
      "official_source_url": "https://codes.ohio.gov/ohio-revised-code/section-149.43",
      "current_effective_date": "Current through 2024",
      "recent_amendments": "No major amendments noted 2022-2024",
      "statutory_text": {
        "section_149_43": {
          "title": "Availability of public records",
          "text": "Public offices must: - Promptly prepare and make records available for inspection - Provide copies at cost - Respond within a reasonable time period - Organize records to facilitate access. Cannot require disclosure of requester's identity or intended use. May ask for written request but cannot mandate it. Can charge actual costs for copying and transmission. Enforcement through mandamus actions with potential statutory damages of $100/day up to $1,000."
        }
      }
    },
    "minnesota": {
      "jurisdiction_info": {
        "jurisdiction_code": "MN",
        "jurisdiction_name": "Minnesota",
        "jurisdiction_type": "state"
      },
      "statute_citation": "Minnesota Statute 13.03",
      "official_source_url": "https://www.revisor.mn.gov/statutes/cite/13.03",
      "current_effective_date": "Current through 2024 Legislative Session",
      "recent_amendments": "No major amendments noted 2022-2024",
      "statutory_text": {
        "section_13_03": {
          "title": "Government Data Practices",
          "text": "Subdivision 1 (Public Data): All government data collected, created, received, maintained or disseminated by a government entity shall be public unless classified as nonpublic or protected nonpublic. Subdivision 2 (Procedures): The responsible authority shall establish procedures to insure that requests for government data are received and complied with in an appropriate and prompt manner. Subdivision 3 (Request for Access): Upon request, a person shall be permitted to inspect and copy public government data at reasonable times and places. For paper data, inspection is visual inspection. For electronic data, inspection includes remote access and ability to print/download. Entities may charge reasonable fees for copying and retrieving data. If 100 or fewer pages are requested, charge cannot exceed 25 cents per page."
        }
      }
    },
    "virginia": {
      "jurisdiction_info": {
        "jurisdiction_code": "VA",
        "jurisdiction_name": "Virginia",
        "jurisdiction_type": "state"
      },
      "statute_citation": "Virginia Code § 2.2-3704",
      "official_source_url": "https://law.lis.virginia.gov/vacodefull/title2.2/chapter37/",
      "current_effective_date": "Current through 2024 Legislative Session",
      "recent_amendments": "No major amendments noted 2022-2024",
      "statutory_text": {
        "section_2_2_3704": {
          "title": "Request for public records; response time",
          "text": "A public body that is the custodian of the requested records shall promptly, but in all cases within five working days of receiving a request, provide the requested records to the requester or make one of the following responses in writing: 1. Entirely withholding records 2. Providing records partially 3. Stating records could not be found or do not exist 4. Indicating it is not practically possible to respond within five work days. The statute allows an additional seven work days (or 60 work days for criminal investigative files) if the initial response is made within five working days and explains why a full response is not immediately possible."
        }
      }
    },
    "washington": {
      "jurisdiction_info": {
        "jurisdiction_code": "WA",
        "jurisdiction_name": "Washington",
        "jurisdiction_type": "state"
      },
      "statute_citation": "RCW 42.56.520",
      "official_source_url": "https://app.leg.wa.gov/RCW/default.aspx?cite=42.56.520",
      "current_effective_date": "Current through 2024 Legislative Session",
      "recent_amendments": "2024 fee structure updates",
      "statutory_text": {
        "section_42_56_520": {
          "title": "Agency response requirements",
          "text": "(1) Responses to requests for public records shall be made promptly by agencies. Within five business days of receiving a public record request, an agency must respond in one of these ways: (a) Providing the record; (b) Providing an internet address and link to the records; (c) Acknowledging receipt and providing a reasonable time estimate; (d) Asking for clarification of an unclear request; or (e) Denying the public record request. Additional time may be needed to clarify the request, locate information, notify affected parties, or determine exemptions. Denials must include a written explanation of specific reasons. Agencies must establish a mechanism for prompt review of inspection denials."
        }
      }
    },
    "arizona": {
      "jurisdiction_info": {
        "jurisdiction_code": "AZ",
        "jurisdiction_name": "Arizona",
        "jurisdiction_type": "state"
      },
      "statute_citation": "Arizona Revised Statutes § 39-121",
      "official_source_url": "https://www.azleg.gov/ars/39/00121.htm",
      "current_effective_date": "Current through 2024 Legislative Session",
      "recent_amendments": "2024 amendments proposed for 5-day response requirement",
      "statutory_text": {
        "section_39_121": {
          "title": "Inspection of public records",
          "text": "Public records and other matters in the custody of any officer shall be open to inspection by any person at all times during office hours."
        }
      }
    },
    "massachusetts": {
      "jurisdiction_info": {
        "jurisdiction_code": "MA",
        "jurisdiction_name": "Massachusetts",
        "jurisdiction_type": "state"
      },
      "statute_citation": "Massachusetts General Laws Chapter 66 § 10",
      "official_source_url": "https://malegislature.gov/Laws/GeneralLaws/PartI/TitleX/Chapter66/Section10",
      "current_effective_date": "Current through 2024 Legislative Session",
      "recent_amendments": "Extensions up to 30 days for municipalities",
      "statutory_text": {
        "section_66_10": {
          "title": "Public records access",
          "text": "Agencies must respond within 10 business days. Response must include: - Confirmation of request receipt - Identification of records available/unavailable - Specific reasons for withholding any records - Estimated timeframe for production - Fee estimate - Appeal rights information. Maximum 5 cents per page for black and white copies. Can charge hourly rate for employee time over 4 hours (max $25/hour). Can petition supervisor of records for additional time. Extensions not to exceed 20 business days for agencies. Extensions not to exceed 30 business days for municipalities."
        }
      }
    }
  },
  "extraction_status": {
    "completed_jurisdictions": 11,
    "remaining_jurisdictions": 40,
    "next_priority_states": [
      "Pennsylvania", "Michigan", "Georgia", "North Carolina", "New Jersey",
      "Virginia", "Washington", "Arizona", "Massachusetts", "Tennessee"
    ]
  }
}