{
  "jurisdiction": {
    "name": "Arkansas",
    "slug": "arkansas",
    "type": "state",
    "transparency_law": "Arkansas Freedom of Information Act"
  },
  "validation_metadata": {
    "parsed_date": "2025-10-09",
    "source_url": "https://advance.lexis.com/container?config=0152JABiMTliYzA3Yy1kOTI3LTQ5YTctYjkyYi05ZTJlOTQyNGE5NmYKAFBvZENhdGFsb2e5OIjQ5n4K5WxW9VlW3BXzXA==",
    "verified_by": "Claude Code AI Assistant",
    "verification_method": "Direct review of Arkansas Code Annotated Title 25, Chapter 19",
    "statutory_text_file": "ARKANSAS_transparency_law-v0.11.txt"
  },
  "rights_of_access": [
    {
      "category": "Inspection Rights",
      "subcategory": "Citizen Right to Inspect and Copy",
      "statute_citation": "Ark. Code Ann. § 25-19-105(a)(1)",
      "description": "Except as otherwise specifically provided by law, all public records shall be open to inspection and copying by any citizen of the State of Arkansas during the regular business hours of the custodian of the records. Arkansas has one of the strongest open government laws in the United States.",
      "conditions": "Must be Arkansas citizen; applies during regular business hours; subject to statutory exemptions",
      "applies_to": "All public records of Arkansas state and local government entities",
      "implementation_notes": "Arkansas FOIA, signed in 1967 by Governor Winthrop Rockefeller, is considered a model transparency law with strong presumption of access",
      "request_tips": "Assert citizenship: 'As an Arkansas citizen, I request to inspect and copy [specific records] under Ark. Code Ann. § 25-19-105(a)(1).'"
    },
    {
      "category": "Technology Rights",
      "subcategory": "Multiple Request Methods",
      "statute_citation": "Ark. Code Ann. § 25-19-105(a)(2)",
      "description": "A citizen may make a request to the custodian to inspect, copy, or receive copies of public records. The request may be made in person, by telephone, by mail, by facsimile transmission, by electronic mail, or by other electronic means provided by the custodian.",
      "conditions": "Multiple methods explicitly authorized; custodian must accommodate various submission methods",
      "applies_to": "All public records requests in Arkansas",
      "implementation_notes": "Arkansas explicitly authorizes modern communication methods, ensuring access is not limited by technology barriers",
      "request_tips": "Use preferred method: 'I am submitting this request [by email/phone/mail/fax] as authorized by Ark. Code Ann. § 25-19-105(a)(2).'"
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "3-Working-Day Availability for Records in Use",
      "statute_citation": "Ark. Code Ann. § 25-19-105(b)(1)",
      "description": "If a public record is in active use or storage and therefore not available at the time a citizen asks to examine it, the custodian shall certify this fact in writing and set a date and hour within three (3) working days at which time the record will be available.",
      "conditions": "Applies only to records actually in active use or storage at time of request; requires written certification; must specify exact date and hour for availability",
      "applies_to": "Public records that are in active use or storage when requested",
      "implementation_notes": "This is maximum delay - agencies cannot use 'active use' as excuse for longer delays; written certification required prevents vague delays",
      "request_tips": "If delayed: 'Under Ark. Code Ann. § 25-19-105(b)(1), please certify in writing that records are in active use and provide specific date/hour within 3 working days when they'll be available.'"
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "Immediate Access for Available Records",
      "statute_citation": "Ark. Code Ann. § 25-19-105(b)(2)",
      "description": "The requirements of subsection (b)(1) do not affect the obligation of a custodian to immediately provide to the requestor any responsive records not in active use or storage. Records must be provided immediately if available.",
      "conditions": "Applies to records not in active use; immediate provision required - no processing time allowed",
      "applies_to": "All readily available public records",
      "implementation_notes": "Arkansas requires immediate access when records are available - agencies cannot impose arbitrary processing delays for records not in use",
      "request_tips": "Demand immediate access: 'Ark. Code Ann. § 25-19-105(b)(2) requires you to immediately provide any responsive records not in active use. Please provide these records now during office hours.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Segregability at Custodian's Cost",
      "statute_citation": "Ark. Code Ann. § 25-19-105(e)(1)",
      "description": "If it is necessary to separate exempt from nonexempt information in order to permit a citizen to inspect, copy, or obtain copies of public records, the custodian shall bear the cost of the separation. Agencies cannot charge for redaction work.",
      "conditions": "Custodian bears cost of redaction/separation; requester only pays for actual copying; applies to all separation work necessary to provide access",
      "applies_to": "Records containing both exempt and non-exempt information",
      "implementation_notes": "This is major requester protection - agencies must do redaction work at their expense, preventing cost from being barrier to access",
      "request_tips": "Assert cost responsibility: 'Under Ark. Code Ann. § 25-19-105(e)(1), you must bear the cost of separating exempt from non-exempt information. I should only be charged for actual copying.'"
    },
    {
      "category": "Fee Waiver",
      "subcategory": "Reasonable Copy Fees Only",
      "statute_citation": "Ark. Code Ann. § 25-19-105(e)(2)(A)",
      "description": "The custodian may charge a reasonable fee for providing copies of public records. Fees must be reasonable and limited to actual copying costs.",
      "conditions": "Fees must be reasonable; cannot include search, review, or redaction time; limited to actual duplication expenses",
      "applies_to": "All copy requests",
      "implementation_notes": "Arkansas limits fees to reasonable amounts for copying only - prevents agencies from using excessive fees to discourage requests",
      "request_tips": "Challenge excessive fees: 'Ark. Code Ann. § 25-19-105(e)(2) limits copy fees to reasonable amounts. Please provide fee breakdown showing only actual copy costs.'"
    },
    {
      "category": "Fee Waiver",
      "subcategory": "$25 Prepayment Threshold",
      "statute_citation": "Ark. Code Ann. § 25-19-105(e)(2)(B)",
      "description": "If the total fees charged by a custodian for copies of public records requested by a citizen exceed twenty-five dollars ($25.00), the custodian may request that the citizen pay in advance for the copies. No prepayment required under $25.",
      "conditions": "Prepayment only allowed if total fees exceed $25; custodian may request but cannot require unless over threshold",
      "applies_to": "Copy fee payments",
      "implementation_notes": "This protects requesters from prepayment demands on small requests; agencies must provide records first if fees are under $25",
      "request_tips": "For fees under $25: 'Ark. Code Ann. § 25-19-105(e)(2)(B) prohibits prepayment requirements for fees under $25. Please provide records and bill me after.'"
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "24-Hour Advance Notice Limit",
      "statute_citation": "Ark. Code Ann. § 25-19-105(f)",
      "description": "A custodian may require reasonable advance notice of not more than twenty-four (24) hours for the inspection of public records. Maximum notice period is 24 hours.",
      "conditions": "Notice must be reasonable; cannot exceed 24 hours; applies only to inspection, not copy requests; custodian must accommodate inspection within 24 hours if notice given",
      "applies_to": "In-person inspection of public records",
      "implementation_notes": "24-hour cap prevents agencies from using 'advance notice' requirements to indefinitely delay access",
      "request_tips": "Provide notice: 'I am providing 24 hours advance notice under Ark. Code Ann. § 25-19-105(f) for inspection of [records] on [date/time]. Please confirm availability.'"
    },
    {
      "category": "Technology Rights",
      "subcategory": "Right to Copy Through Photography and Video",
      "statute_citation": "Ark. Code Ann. § 25-19-105(e)(1)",
      "description": "Citizens have the explicit right to copy public records through image capture, including still and moving photography and video and digital recording. This includes using personal devices to photograph or video record public records.",
      "conditions": "Included in statutory definition of 'copy'; applies during inspection; custodian may supervise to protect record integrity",
      "applies_to": "All public records available for inspection",
      "implementation_notes": "Arkansas explicitly includes photography and video recording in copying rights, allowing use of smartphones and cameras",
      "request_tips": "Assert technology rights: 'Ark. Code Ann. § 25-19-105(e)(1) includes still and moving photography in my right to copy. I will use my [phone/camera] to photograph these records during inspection.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Burden of Proof on Custodian",
      "statute_citation": "Ark. Code Ann. § 25-19-109(b)",
      "description": "The burden of proof that an exemption to this chapter permits the denial of access shall be on the custodian of the public record or the governing body. Government must prove exemptions apply.",
      "conditions": "Burden always on custodian to prove exemption; requester does not have to prove right to access; custodian must show specific statutory authority",
      "applies_to": "All denials of public records access",
      "implementation_notes": "This creates strong presumption of access - agencies cannot simply deny and force requester to prove they're wrong; agency must affirmatively prove exemption applies",
      "request_tips": "Challenge denials: 'Under Ark. Code Ann. § 25-19-109(b), you bear the burden of proving any exemption permits denial. Please cite specific statutory authority and explain how it applies to these specific records.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Attorney Fee Recovery for Bad Faith Denials",
      "statute_citation": "Ark. Code Ann. § 25-19-109(c)",
      "description": "If the court finds that the custodian or governing body acted in bad faith in denying access to public records or a public meeting, the court may assess against the responsible custodian or governing body the costs, reasonable attorney's fees, and other reasonable expenses incurred by any person seeking disclosure.",
      "conditions": "Requires finding of bad faith; court has discretion; covers attorney fees, costs, and other reasonable expenses",
      "applies_to": "Successful court challenges where bad faith is proven",
      "implementation_notes": "Fee-shifting for bad faith creates strong deterrent against improper denials; makes litigation financially feasible for requesters",
      "request_tips": "When considering litigation: 'Ark. Code Ann. § 25-19-109(c) provides for attorney fee recovery if bad faith is proven. Your unjustified denial may result in your agency paying my legal costs.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Criminal Penalties for Violations",
      "statute_citation": "Ark. Code Ann. § 25-19-107",
      "description": "Any person who purposely violates this chapter commits a Class C misdemeanor and shall be subject to a fine not to exceed five hundred dollars ($500). Criminal penalties apply for willful violations.",
      "conditions": "Violation must be purposeful/willful; classified as Class C misdemeanor; maximum fine $500",
      "applies_to": "Willful violations of Arkansas FOIA by any person",
      "implementation_notes": "Criminal penalties create personal accountability for officials who purposely violate transparency law",
      "request_tips": "For willful violations: 'Ark. Code Ann. § 25-19-107 makes purposeful FOIA violations a Class C misdemeanor. Your continued refusal may constitute a criminal violation.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Direct Court Access",
      "statute_citation": "Ark. Code Ann. § 25-19-109(a)",
      "description": "Any citizen denied access to public records or public meetings may seek enforcement of this chapter in the circuit court for the county in which the public records are located or where the public meeting occurred or was to occur. No administrative appeal required.",
      "conditions": "No requirement to exhaust administrative remedies; may proceed directly to circuit court; file in county where records located or meeting occurred",
      "applies_to": "All denials of access to public records or meetings",
      "implementation_notes": "Arkansas does not impose administrative exhaustion requirement - requesters can go directly to court after denial",
      "request_tips": "Note enforcement option: 'Under Ark. Code Ann. § 25-19-109(a), I may seek enforcement directly in circuit court without exhausting administrative appeals if you deny this request.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Strong Presumption of Openness",
      "statute_citation": "Ark. Code Ann. § 25-19-103",
      "description": "It is vital in a democratic society that public business be performed in an open and public manner. Arkansas FOIA is adopted to make it possible for electors and taxpayers to evaluate public officials and reduce fraud and corruption. This creates strong presumption favoring disclosure.",
      "conditions": "Applies to all public records and meetings; establishes legislative intent favoring maximum transparency; guides interpretation of all FOIA provisions",
      "applies_to": "All Arkansas FOIA interpretations and applications",
      "implementation_notes": "This policy declaration guides courts to interpret FOIA liberally in favor of disclosure; any ambiguities resolved toward access",
      "request_tips": "Cite legislative purpose: 'Ark. Code Ann. § 25-19-103 establishes that Arkansas FOIA must be liberally construed to advance transparency. Any doubt should be resolved in favor of disclosure.'"
    }
  ]
}
