{
  "jurisdiction": {
    "name": "Arizona",
    "slug": "arizona",
    "type": "state",
    "transparency_law": "Arizona Public Records Law"
  },
  "validation_metadata": {
    "parsed_date": "2025-10-09",
    "source_url": "https://www.azleg.gov/ArizonaRevisedStatutes.asp",
    "verified_by": "Claude Code AI Assistant",
    "verification_method": "Direct review of Arizona Revised Statutes Title 39, Chapter 1",
    "statutory_text_file": "ARIZONA_transparency_law-v0.11.txt"
  },
  "rights_of_access": [
    {
      "category": "Inspection Rights",
      "subcategory": "Open Inspection During Office Hours",
      "statute_citation": "Ariz. Rev. Stat. § 39-121(A)",
      "description": "Public records and other matters in the custody of any officer shall be open to inspection by any person at all times during office hours. This establishes Arizona's foundational right of immediate public access to government records.",
      "conditions": "Inspection must be during regular office hours; applies to all public records unless specifically exempted by statute",
      "applies_to": "All public records in custody of Arizona state and local government officers",
      "implementation_notes": "Arizona does not require residency - 'any person' includes anyone. Inspection is immediate and continuous during office hours, not subject to delays for processing.",
      "request_tips": "Assert: 'Under A.R.S. § 39-121(A), I request immediate inspection of [specific records] during your regular office hours.'"
    },
    {
      "category": "Technology Rights",
      "subcategory": "Right to Copies, Printouts, and Photographs",
      "statute_citation": "Ariz. Rev. Stat. § 39-121.01(B)",
      "description": "Any person may request to examine or be furnished copies, printouts or photographs of any public record during regular office hours or may request that the custodian mail a copy. This ensures access in multiple formats.",
      "conditions": "Available during regular office hours; custodian may require advance payment for mailed copies; fees limited to actual reproduction costs",
      "applies_to": "All public records",
      "implementation_notes": "Arizona explicitly includes photographs and printouts alongside traditional copies; requester can choose examination, copies, or both",
      "request_tips": "Specify format: 'Under A.R.S. § 39-121.01(B), I request [copies/photographs/printouts] of [records], to be [examined in person/mailed to me].'"
    },
    {
      "category": "Fee Waiver",
      "subcategory": "Copy Fee Cap",
      "statute_citation": "Ariz. Rev. Stat. § 39-121.01(B)(1)",
      "description": "The fee for copies, printouts or photographs of public records shall not exceed the amount per page established by the director of the Arizona Department of Administration. Fees cannot exceed actual reproduction costs.",
      "conditions": "Fee must be clearly set forth; cannot exceed amount necessary to reimburse actual costs; statewide cap set by Department of Administration director",
      "applies_to": "All paper copies, printouts, and photographs of public records",
      "implementation_notes": "Arizona uses centralized fee cap set by state authority, ensuring statewide consistency; prevents agencies from charging arbitrary or excessive amounts",
      "request_tips": "Challenge excessive fees: 'A.R.S. § 39-121.01(B)(1) limits copy fees to the amount established by the Department of Administration and actual reproduction costs. Please provide fee justification.'"
    },
    {
      "category": "Technology Rights",
      "subcategory": "Electronic Format at Actual Cost",
      "statute_citation": "Ariz. Rev. Stat. § 39-121.01(B)(2)",
      "description": "Public bodies that maintain their records in electronic format may charge for copies of records provided in electronic format the actual cost of producing the records. Electronic delivery should be minimal cost.",
      "conditions": "Records must be maintained in electronic format; fee limited to actual production cost only",
      "applies_to": "Records maintained electronically by Arizona public bodies",
      "implementation_notes": "Actual cost for electronic production is typically very low (often negligible for email delivery); prevents agencies from charging paper-level fees for electronic records",
      "request_tips": "Request electronic format: 'Under A.R.S. § 39-121.01(B)(2), please provide these electronic records electronically at actual production cost (typically minimal for email delivery).'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Written Statement of Authority Required",
      "statute_citation": "Ariz. Rev. Stat. § 39-121.01(C)",
      "description": "If requested, the custodian of the records of any public body shall promptly furnish a written statement indicating the specific statutory authority for the disclosure or nondisclosure of information contained in any record.",
      "conditions": "Must be provided if requested; must be furnished promptly; must cite specific statutory authority",
      "applies_to": "All public records requests where requester asks for legal justification",
      "implementation_notes": "This prevents vague or unsupported denials - agencies must cite specific legal authority, not just claim records are 'confidential' without basis",
      "request_tips": "Demand transparency: 'Under A.R.S. § 39-121.01(C), I request a written statement citing the specific statutory authority for any nondisclosure of requested records.'"
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "5-Business-Day Acknowledgment Requirement",
      "statute_citation": "Ariz. Rev. Stat. § 39-132(A)",
      "description": "If a public record is requested in writing, the custodian shall acknowledge receipt of the request within five business days. The acknowledgment must include: date received, unique identification number, statement about processing, and contact information.",
      "conditions": "Applies to written requests; required since January 1, 2023; acknowledgment must include 4 specific elements listed in statute",
      "applies_to": "All written public records requests to Arizona public bodies",
      "implementation_notes": "This 2023 requirement ensures requesters receive prompt confirmation and tracking information for their requests",
      "request_tips": "Cite new requirement: 'A.R.S. § 39-132(A) requires acknowledgment within 5 business days, including request date, ID number, processing statement, and contact info. Please confirm receipt.'"
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "15-Day Estimated Completion Notice",
      "statute_citation": "Ariz. Rev. Stat. § 39-132(B)",
      "description": "If the public record will not be provided within fifteen business days after the request is received, the custodian shall provide an estimated date that the request will be completed and reasons for the delay.",
      "conditions": "Required when records won't be provided within 15 business days; must include both estimated completion date and reasons for delay",
      "applies_to": "Written requests that will take more than 15 business days to fulfill",
      "implementation_notes": "This prevents agencies from indefinitely delaying requests without explanation; requester gets timeline and justification for any delay",
      "request_tips": "After 15 days without records: 'A.R.S. § 39-132(B) requires you to provide an estimated completion date and reasons for delay when records aren't provided within 15 business days. Please provide this information.'"
    },
    {
      "category": "Technology Rights",
      "subcategory": "Format Accommodation Requirement",
      "statute_citation": "Ariz. Rev. Stat. § 39-132(C)",
      "description": "The custodian shall make reasonable efforts to provide public records in the format requested if the records exist in that format. Agencies must accommodate format preferences when feasible.",
      "conditions": "Records must exist in requested format; agency must make reasonable efforts; accommodation required when feasible",
      "applies_to": "All public records requests where specific format is requested",
      "implementation_notes": "If records exist as spreadsheets, requester can get spreadsheet format rather than PDF; if records are in email, requester can get email format",
      "request_tips": "Specify format: 'Under A.R.S. § 39-132(C), please provide these records in [Excel/Word/native email/etc.] format as they exist in that format. Make reasonable efforts to accommodate this request.'"
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "20-Day Response for Sensitive Requests",
      "statute_citation": "Ariz. Rev. Stat. § 39-123(A)",
      "description": "If a public record is requested in writing and involves a personnel matter, criminal investigative information or is requested for a commercial purpose, the custodian shall respond within twenty business days stating whether records are available, not public, or confidential.",
      "conditions": "Applies to personnel matters, criminal investigations, and commercial purpose requests; response must indicate one of 3 specified options; failure to respond is criminal misdemeanor",
      "applies_to": "Written requests for personnel, criminal investigative, or commercial-purpose records",
      "implementation_notes": "Response doesn't have to provide records within 20 days, but must inform requester of status; agency cannot remain silent",
      "request_tips": "For sensitive requests: 'A.R.S. § 39-123(A) requires a response within 20 business days for this [personnel/criminal investigative/commercial] request. Please respond with record status.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Cumulative Rights and Remedies",
      "statute_citation": "Ariz. Rev. Stat. § 39-127",
      "description": "The rights and remedies provided by this article are cumulative, and the use of one right or remedy by any person does not preclude the person from using other rights or remedies. Requesters have multiple enforcement options.",
      "conditions": "All remedies may be pursued; exercising one doesn't waive others; applies to all enforcement mechanisms",
      "applies_to": "All public records enforcement actions",
      "implementation_notes": "Requesters can pursue criminal complaints, civil actions, ombudsman complaints, and other remedies simultaneously or sequentially without waiving any rights",
      "request_tips": "Note enforcement options: 'A.R.S. § 39-127 confirms my rights are cumulative. I may pursue multiple remedies including [criminal complaint/civil action/ombudsman complaint] without waiving other options.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Criminal Penalties for Refusal",
      "statute_citation": "Ariz. Rev. Stat. § 39-121.02",
      "description": "Any officer who has custody of any public record who unlawfully refuses to allow the examination and copying of such record is guilty of a class 2 misdemeanor. This creates personal criminal liability for violations.",
      "conditions": "Refusal must be unlawful; applies to officers with custody; classified as class 2 misdemeanor",
      "applies_to": "Public officers who unlawfully refuse inspection or copying rights",
      "implementation_notes": "Criminal penalties create strong deterrent against improper refusals; violations are personally prosecutable against responsible officers",
      "request_tips": "For unlawful refusals: 'A.R.S. § 39-121.02 makes unlawful refusal to allow examination and copying a class 2 misdemeanor. I may file a criminal complaint if you continue to refuse this lawful request.'"
    },
    {
      "category": "Requester-Specific Rights",
      "subcategory": "Commercial Purpose Statement Requirement",
      "statute_citation": "Ariz. Rev. Stat. § 39-121.03(A)",
      "description": "Any person requesting to examine or copy public records for a commercial purpose shall provide a statement setting forth the commercial purpose. However, records must still be provided unless governor issues executive order prohibiting specific commercial use.",
      "conditions": "Statement required only when requesting for commercial purpose; commercial purpose defined as use for sale/resale or producing document for sale; agency can request governor prohibit disclosure, but must provide records if no executive order within 30 days",
      "applies_to": "Requests for commercial purposes as defined in statute",
      "implementation_notes": "Even commercial requesters get access - agencies can't simply deny commercial requests. Governor's executive order is rare safeguard for serious misuse only.",
      "request_tips": "If asked about commercial use: 'My request is not for commercial purpose as defined in A.R.S. § 39-121.03(C) (sale/resale). Even if it were, § 39-121.03(B) requires you to provide records unless governor issues executive order, which you must request within 30 days.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Record-Keeping and Index Requirements",
      "statute_citation": "Ariz. Rev. Stat. § 39-121.01(D)",
      "description": "All public bodies shall maintain records reasonably necessary to provide knowledge of their activities. All public bodies shall maintain an index of their public records (or alternative organizational system approved by state archives).",
      "conditions": "Records must be reasonably necessary to document activities; index required unless alternative system approved by Arizona State Library, Archives and Public Records",
      "applies_to": "All Arizona public bodies",
      "implementation_notes": "This mandates both creation of records and organizational systems, ensuring records exist and can be found; supports requester rights by requiring searchable organization",
      "request_tips": "If records claimed not to exist: 'A.R.S. § 39-121.01(D) requires your agency to maintain records reasonably necessary to provide knowledge of activities. Please confirm compliance with this requirement or provide your records index/organizational system.'"
    }
  ]
}
