{
  "jurisdiction": {
    "name": "Indiana",
    "slug": "indiana",
    "type": "state",
    "transparency_law": "Indiana Access to Public Records Act (APRA)"
  },
  "validation_metadata": {
    "parsed_date": "2025-10-10",
    "source_url": "http://iga.in.gov/legislative/laws/2023/ic/titles/005#5-14-3",
    "verified_by": "Claude Code AI Assistant",
    "verification_method": "Direct review of IC 5-14-3-1 et seq.",
    "statutory_text_file": "indiana_transparency_law-v0.11.txt"
  },
  "rights_of_access": [
    {
      "category": "Inspection Rights",
      "subcategory": "Universal Right to Complete Information",
      "statute_citation": "IC 5-14-3-1",
      "description": "All persons are entitled to full and complete information regarding the affairs of government and the official acts of public officials and employees. Legislature declared government is the servant of the people, not their master. All records are presumed open to inspection and copying.",
      "conditions": "Applies to all persons; strong presumption of openness; government serves people philosophy",
      "applies_to": "All public records in Indiana",
      "implementation_notes": "Fundamental democratic principle - government serves people, requiring transparency; explicit presumption places burden on government to justify withholding",
      "request_tips": "Assert: 'IC 5-14-3-1 declares all persons entitled to complete information about government. Government is the servant of the people. Please provide [records] under this statutory presumption.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Oral Request Option",
      "statute_citation": "IC 5-14-3-3",
      "description": "Requests can be made orally or in writing. No specific form required. This reduces barriers to access and allows informal requests.",
      "conditions": "Oral or written requests both accepted; must reasonably describe records; no purpose statement required; no residency requirement",
      "applies_to": "All APRA requests in Indiana",
      "implementation_notes": "Unique flexibility - oral requests permitted for simple matters; reduces formality barriers; still must adequately describe records sought",
      "request_tips": "For simple requests: 'IC 5-14-3-3 permits oral requests. I orally request [simple record description]. Please confirm you will process this oral request.'"
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "24-Hour Acknowledgment for In-Person/Phone",
      "statute_citation": "IC 5-14-3-3",
      "description": "For in-person or phone requests, agencies must acknowledge within 24 hours. For mail, fax, or email requests, must acknowledge within 7 days.",
      "conditions": "24 hours for in-person/phone; 7 days for written requests; acknowledgment confirms receipt and provides timeline estimate",
      "applies_to": "All APRA requests",
      "implementation_notes": "Fast acknowledgment requirement ensures requests not lost; creates accountability for timely processing",
      "request_tips": "Follow up: 'IC 5-14-3-3 requires acknowledgment within [24 hours/7 days depending on method]. Please confirm receipt and estimated production date.'"
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "Reasonable Time Production Standard",
      "statute_citation": "IC 5-14-3-3",
      "description": "After acknowledgment, agencies must provide records within 'reasonable time'. Reasonableness depends on agency size, request size, pending requests, complexity, and operational considerations.",
      "conditions": "Flexible standard based on circumstances; no fixed deadline; considers practicalities; must be objectively reasonable",
      "applies_to": "Record production after acknowledgment",
      "implementation_notes": "Context-dependent standard allows flexibility but requires genuine reasonableness; unreasonable delays can be challenged; small simple requests should be fast",
      "request_tips": "Assert reasonableness: 'IC 5-14-3-3 requires production within reasonable time. Given [simple nature/small size] of this request, production within [specific timeframe] is reasonable. Please confirm.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Public Access Counselor Guidance",
      "statute_citation": "IC 5-14-4",
      "description": "Indiana Public Access Counselor provides advisory opinions on public access laws, education, and guidance. Appointed by Governor for 4-year term.",
      "conditions": "Advisory opinions only (not binding); provides expert guidance; free resource for requesters and agencies",
      "applies_to": "APRA interpretive questions and disputes",
      "implementation_notes": "PAC provides accessible expert guidance; while opinions not binding, they carry significant persuasive weight; helps resolve disputes informally",
      "request_tips": "Seek guidance: 'I may consult the Public Access Counselor under IC 5-14-4 for an advisory opinion on this matter. Please reconsider to avoid PAC involvement.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Judicial Review with Attorney Fees",
      "statute_citation": "IC 5-14-3-9",
      "description": "Aggrieved parties may file lawsuit in court of competent jurisdiction for injunctive or declaratory relief. Attorney's fees available in some circumstances.",
      "conditions": "File in court of competent jurisdiction; seek injunctive/declaratory relief; attorney fees discretionary",
      "applies_to": "APRA violations in Indiana",
      "implementation_notes": "Judicial remedy available; attorney fees provision helps offset litigation costs for meritorious cases",
      "request_tips": "Warn of litigation: 'IC 5-14-3-9 provides for judicial review with potential attorney fees. I am prepared to pursue this remedy if you do not provide lawful access.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Separability Requirement",
      "statute_citation": "IC 5-14-3-6",
      "description": "Agencies must separate and withhold only confidential portions of records. Non-confidential portions must be disclosed.",
      "conditions": "Mandatory segregation; cannot withhold entire document when portions are public; must perform redaction analysis",
      "applies_to": "Records containing both public and exempt information",
      "implementation_notes": "Prevents overbroad withholding; agencies must carefully review each record to identify truly exempt portions",
      "request_tips": "Assert segregability: 'IC 5-14-3-6 requires you to separate confidential from non-confidential portions. Please produce all non-confidential portions with only specific exempt information redacted.'"
    }
  ]
}
