{
  "jurisdiction": {"name": "Massachusetts", "slug": "massachusetts", "type": "state", "transparency_law": "Massachusetts Public Records Law"},
  "validation_metadata": {"parsed_date": "2025-10-10", "source_url": "https://malegislature.gov/Laws/GeneralLaws/PartI/TitleX/Chapter66/Section10", "verified_by": "Claude Code AI Assistant", "verification_method": "Direct review of M.G.L. c. 66, § 10 (enhanced 2017 version)", "statutory_text_file": "massachusetts_transparency_law-v0.11.txt"},
  "rights_of_access": [
    {"category": "Enhanced Access Rights", "subcategory": "Designated Records Access Officer", "statute_citation": "M.G.L. c. 66, § 10", "description": "Each agency and municipality must designate a Records Access Officer (RAO) who coordinates responses to public records requests and assists requesters in obtaining records.", "conditions": "Mandatory RAO designation; RAO assists requesters; coordinates compliance", "applies_to": "All Massachusetts agencies and municipalities", "implementation_notes": "Creates clear accountability point; RAO must help requesters navigate process", "request_tips": "Request RAO info: 'M.G.L. c. 66, § 10 requires you to designate a Records Access Officer. Please direct this request to your RAO and provide contact information.'"},
    {"category": "Timeliness Rights", "subcategory": "10-Business-Day Response Requirement", "statute_citation": "M.G.L. c. 66, § 10", "description": "Records Access Officer must respond within 10 business days (excluding Saturdays, Sundays, legal holidays, or days when office unexpectedly closed). Initial response may include fee estimate for complex requests. Additional 15 business days allowed after payment for record production.", "conditions": "10 business days for response; excludes weekends/holidays/unexpected closures; 15 additional days after payment if needed", "applies_to": "All public records requests", "implementation_notes": "Enhanced 2017 law clarified timelines and fee limitations", "request_tips": "Cite deadline: 'M.G.L. c. 66, § 10 requires RAO response within 10 business days. Please respond by [date excluding weekends/holidays].'"},
    {"category": "Enhanced Access Rights", "subcategory": "Detailed Denial Requirements", "statute_citation": "M.G.L. c. 66, § 10", "description": "Denials must detail specific basis for withholding materials, cite statutory or common law exemptions relied upon, and explain why exemption applies.", "conditions": "Must detail specific basis; must cite exemptions; must explain application", "applies_to": "All denials", "implementation_notes": "Prevents boilerplate denials; requires agencies to justify with specificity", "request_tips": "Challenge inadequate denial: 'M.G.L. c. 66, § 10 requires detailed denial with specific statutory citations and explanation of why exemptions apply. Please provide compliant denial or release records.'"},
    {"category": "Appeal Rights", "subcategory": "Supervisor of Records Appeal", "statute_citation": "M.G.L. c. 66, § 10A", "description": "Primary appeal authority for denied requests is Supervisor of Records in Office of Secretary of the Commonwealth. Provides structured administrative review before judicial action.", "conditions": "File appeal with Supervisor of Records; administrative review process; judicial review available after", "applies_to": "Denied requests in Massachusetts", "implementation_notes": "Specialized oversight through Supervisor of Records; accessible administrative remedy", "request_tips": "Assert appeal: 'I may appeal this denial to the Supervisor of Records under M.G.L. c. 66, § 10A. Please reconsider to avoid Supervisor involvement.'"}
  ]
}