{
  "jurisdiction": {"name": "Michigan", "slug": "michigan", "type": "state", "transparency_law": "Michigan Freedom of Information Act"},
  "validation_metadata": {"parsed_date": "2025-10-10", "source_url": "https://www.legislature.mi.gov/Laws/MCL?objectName=mcl-15-231", "verified_by": "Claude Code AI Assistant", "verification_method": "Direct review of MCL 15.231 et seq. including 2023 amendments", "statutory_text_file": "michigan_transparency_law-v0.11.txt"},
  "rights_of_access": [
    {"category": "Inspection Rights", "subcategory": "Prompt Preparation and Availability", "statute_citation": "MCL 15.235", "description": "Public records responsive to request shall be promptly prepared and made available for inspection to any person at all reasonable times during regular business hours. Copies made available at cost within reasonable period.", "conditions": "Must be prepared promptly; available at reasonable times; copies at cost in reasonable period", "applies_to": "All Michigan public records", "implementation_notes": "No residency requirement; dual obligation to prepare and make available", "request_tips": "Assert: 'MCL 15.235 requires prompt preparation and availability at reasonable times. Please confirm when I may inspect [records].'"},
    {"category": "Timeliness Rights", "subcategory": "5-Business-Day Response with 10-Day Extension", "statute_citation": "MCL 15.235", "description": "Public body must respond within 5 business days. May extend by additional 10 business days with written notice providing reason and new due date. Only one extension permitted per request.", "conditions": "5 days initial; 10 additional days max; written notice required; one extension only", "applies_to": "All FOIA requests in Michigan", "implementation_notes": "Total maximum 15 business days; single extension prevents indefinite delays", "request_tips": "Cite deadline: 'MCL 15.235 requires 5-business-day response. You may extend once by 10 days with written notice and reason. Please respond by [date].'"},
    {"category": "Fee Waiver", "subcategory": "Fee Estimate for Requests Over $50", "statute_citation": "MCL 15.235", "description": "Must provide detailed fee estimate if costs expected to exceed $50. May require deposit for estimated costs exceeding $100. Fees must be actual cost, not profit-making.", "conditions": "Estimate required if over $50; deposit if over $100; limited to actual costs", "applies_to": "All fees in Michigan", "implementation_notes": "Estimate-before-work prevents surprise bills; actual cost standard prevents inflated fees", "request_tips": "Request estimate: 'MCL 15.235 requires fee estimate if costs will exceed $50. Please provide detailed estimate limited to actual costs before proceeding.'"},
    {"category": "Appeal Rights", "subcategory": "Administrative Appeal to Agency Head", "statute_citation": "MCL 15.240", "description": "Must file appeal to head of public body within 180 days of denial. Head has 10 business days to respond to appeal.", "conditions": "180 days to appeal; appeal to agency head first; 10 business days for head's response", "applies_to": "Denied FOIA requests", "implementation_notes": "Administrative exhaustion before judicial review; generous 180-day appeal window", "request_tips": "Assert appeal: 'I may appeal this denial to your head of public body within 180 days under MCL 15.240. Head must respond within 10 business days. Please reconsider.'"},
    {"category": "Appeal Rights", "subcategory": "Circuit Court with Attorney Fees and Damages", "statute_citation": "MCL 15.240", "description": "After administrative appeal, may seek judicial review in circuit court. Court may award attorney fees and costs to prevailing plaintiff. May assess damages against public body for bad faith denial.", "conditions": "Circuit court jurisdiction; attorney fees for prevailing plaintiffs; damages for bad faith", "applies_to": "FOIA litigation post-administrative appeal", "implementation_notes": "Fee-shifting and damages provisions make enforcement viable; bad faith standard deters improper denials", "request_tips": "Warn: 'MCL 15.240 provides for attorney fees and potential damages for bad faith denials. I am prepared to pursue full legal remedies if necessary.'"}
  ]
}