{
  "jurisdiction": {"name": "Montana", "slug": "montana", "type": "state", "transparency_law": "Montana Public Information Law"},
  "validation_metadata": {"parsed_date": "2025-10-10", "source_url": "https://leg.mt.gov/bills/mca/title_0020/chapter_0060/parts_index.html", "verified_by": "Claude Code AI Assistant", "verification_method": "Direct review of MCA Title 2, Chapter 6", "statutory_text_file": "montana_transparency_law-v0.11.txt"},
  "rights_of_access": [
    {"category": "Inspection Rights", "subcategory": "Constitutional Right to Examine Documents", "statute_citation": "Mont. Const. Art. II, § 9; MCA Title 2, Ch. 6", "description": "Montana Constitution provides: 'No person shall be deprived of the right to examine documents or to observe the deliberations of all public bodies or agencies of state government and its subdivisions, except in cases in which the demand of individual privacy clearly exceeds the merits of public disclosure.' Statute implements this constitutional mandate.", "conditions": "Constitutional foundation; applies unless privacy clearly exceeds disclosure merits; covers documents AND deliberations", "applies_to": "All Montana government documents and proceedings", "implementation_notes": "One of strongest constitutional protections in nation; privacy must CLEARLY exceed public merit - high bar for withholding", "request_tips": "Assert constitutional right: 'Montana Constitution Article II, Section 9 guarantees my right to examine government documents. Privacy must clearly exceed public disclosure merits to justify withholding [records].'"},
    {"category": "Timeliness Rights", "subcategory": "5-Business-Day Acknowledgment (Executive Branch)", "statute_citation": "MCA § 2-6-1006", "description": "Executive branch agencies must acknowledge receipt within 5 business days. For single, specific, clearly identifiable, readily available records, must provide within 5 working days of acknowledgment.", "conditions": "Applies to executive branch only; 5 days to acknowledge; additional 5 days to produce simple records; non-executive has different standard", "applies_to": "Executive branch agencies (expanded to Secretary of State, DOJ, Superintendent, Auditor effective Oct 1, 2025)", "implementation_notes": "Two-tier system - executive branch has faster timeline than non-executive; total 10 working days for simple requests", "request_tips": "For executive agencies: 'MCA § 2-6-1006 requires acknowledgment within 5 business days and production within 5 working days for readily available records. Please confirm compliance timeline.'"},
    {"category": "Timeliness Rights", "subcategory": "Timely Manner Standard (Non-Executive)", "statute_citation": "MCA § 2-6-1006", "description": "Non-executive branch agencies must respond in timely manner by making information available or providing estimate of time and fees if information cannot be readily identified/gathered.", "conditions": "Flexible 'timely manner' standard; must provide access or estimate; less rigid than executive branch timeline", "applies_to": "Non-executive branch public bodies", "implementation_notes": "Context-dependent standard allows flexibility for varied agency types; still requires prompt action", "request_tips": "For non-executive bodies: 'MCA § 2-6-1006 requires timely response. Please provide access or estimate of timeline and fees if records require gathering.'"},
    {"category": "Enhanced Access Rights", "subcategory": "Constitutional Privacy Balancing Test", "statute_citation": "Mont. Const. Art. II, § 9", "description": "Records may only be withheld when demand of individual privacy clearly exceeds the merits of public disclosure. This constitutional balancing test heavily favors disclosure.", "conditions": "Privacy must CLEARLY exceed disclosure merits; applies to all withholding decisions; constitutional standard", "applies_to": "All privacy-based withholding in Montana", "implementation_notes": "'Clearly exceeds' sets high bar - close calls favor disclosure; constitutional protection prevents legislative erosion", "request_tips": "Challenge privacy claim: 'Montana Constitution requires individual privacy to clearly exceed public disclosure merits. Please demonstrate how privacy clearly - not merely possibly - exceeds the public interest in [records].'"}
  ]
}