{
  "jurisdiction": {"name": "Nebraska", "slug": "nebraska", "type": "state", "transparency_law": "Nebraska Public Records Act"},
  "validation_metadata": {"parsed_date": "2025-10-10", "source_url": "https://nebraskalegislature.gov/laws/browse-statutes.php", "verified_by": "Claude Code AI Assistant", "verification_method": "Direct review of Neb. Rev. Stat. §§ 84-712 through 84-712.09", "statutory_text_file": "nebraska_transparency_law-v0.11.txt"},
  "rights_of_access": [
    {"category": "Inspection Rights", "subcategory": "Public Access to All Records", "statute_citation": "Neb. Rev. Stat. § 84-712.01", "description": "All records and documents, regardless of physical form, of or belonging to state, county, city, village, political subdivision, or tax-supported district are public records open to inspection by any person.", "conditions": "Applies to any person; covers all physical forms; presumption of access", "applies_to": "All public records in Nebraska", "implementation_notes": "No residency requirement; broad definition includes all government levels", "request_tips": "Assert: 'Neb. Rev. Stat. § 84-712.01 opens all Nebraska public records to any person. Please provide access to [records] under this statutory right.'"},
    {"category": "Timeliness Rights", "subcategory": "4-Business-Day Response Requirement", "statute_citation": "Neb. Rev. Stat. § 84-712.01", "description": "Upon receipt of written request, custodian must within 4 business days provide: (a) cost estimate and access/copies, (b) written denial with statutory citations, or (c) written explanation with earliest practicable date if request extensive/difficult.", "conditions": "4 business days for one of three responses; written explanation required for delays; statutory citations required for denials", "applies_to": "All written requests in Nebraska", "implementation_notes": "Fast timeline; clear response options; detailed denial requirements prevent vague refusals", "request_tips": "Cite deadline: 'Neb. Rev. Stat. § 84-712.01 requires response within 4 business days providing records/estimate, denial with citations, or explanation with timeline. Please respond by [date].'"},
    {"category": "Enhanced Access Rights", "subcategory": "Detailed Denial Requirements", "statute_citation": "Neb. Rev. Stat. § 84-712.04", "description": "Written denial must include description of withheld record contents, specific reasons for denial, particular statutes and subsections relied upon, and notice of appeal rights.", "conditions": "Must describe withheld contents; must cite specific statutory subsections; must notify of appeals", "applies_to": "All denials in Nebraska", "implementation_notes": "Comprehensive denial requirements prevent boilerplate refusals; facilitates meaningful appeal", "request_tips": "Challenge inadequate denial: 'Neb. Rev. Stat. § 84-712.04 requires detailed denial describing withheld contents, specific statutory subsections cited, and appeal rights. Please provide compliant denial or release records.'"},
    {"category": "Enhanced Access Rights", "subcategory": "Liberal Construction for Fiscal Records", "statute_citation": "Neb. Rev. Stat. § 84-712.01", "description": "Statutes must be liberally construed when involving state, county, or political subdivision fiscal records including audits, warrants, vouchers, invoices, purchase orders, requisitions, payroll, checks, receipts, or other records involving public funds.", "conditions": "Applies specifically to fiscal records; requires liberal construction favoring access", "applies_to": "All fiscal and financial public records", "implementation_notes": "Special protection for financial transparency; narrower construction not permitted for money records", "request_tips": "For financial records: 'These fiscal records must be liberally construed for access under Neb. Rev. Stat. § 84-712.01. Please interpret any ambiguity in favor of providing these financial records.'"},
    {"category": "Fee Waiver", "subcategory": "Actual Cost Standard with Estimate Requirement", "statute_citation": "Neb. Rev. Stat. § 84-712.03", "description": "May charge actual costs of copying and staff time for search/retrieval. Cannot charge more than actual cost incurred. Must provide cost estimate before fulfilling request.", "conditions": "Limited to actual costs; estimate required before proceeding; prevents surprise bills", "applies_to": "All fees in Nebraska", "implementation_notes": "Estimate-before-work protects requesters from unexpected charges", "request_tips": "Request estimate: 'Neb. Rev. Stat. § 84-712.03 requires cost estimate before fulfilling request and limits fees to actual costs. Please provide detailed estimate before proceeding.'"}
  ]
}