{
  "jurisdiction": {
    "name": "North Dakota",
    "slug": "north-dakota",
    "type": "state",
    "transparency_law": "North Dakota Open Records Statute"
  },
  "validation_metadata": {
    "parsed_date": "2025-10-10",
    "source_url": "https://ndlegis.gov/cencode/t44c04.html",
    "verified_by": "Claude Code AI Assistant",
    "verification_method": "Direct review of NDCC Chapter 44-04",
    "statutory_text_file": "NORTH_DAKOTA_transparency_law-v0.11.txt"
  },
  "rights_of_access": [
    {
      "category": "Inspection Rights",
      "subcategory": "Constitutional Right to Access",
      "statute_citation": "ND Const. Art. XI, § 6; NDCC 44-04-18",
      "description": "North Dakota Constitution (1977 amendment) provides that unless otherwise provided by law, all records of public or governmental bodies shall be public records, open and accessible for inspection during reasonable office hours. Statute implements this constitutional mandate.",
      "conditions": "Constitutional foundation; open unless specifically exempted; reasonable office hours; applies to all public entities",
      "applies_to": "All public records in North Dakota",
      "implementation_notes": "Unique constitutional protection - not merely statutory but constitutionally guaranteed access; elevates transparency to fundamental right",
      "request_tips": "Assert constitutional right: 'North Dakota Constitution Article XI, Section 6 guarantees all governmental records are public unless specifically exempted. Please provide [records] under this constitutional mandate.'"
    },
    {
      "category": "Inspection Rights",
      "subcategory": "Accessible During Reasonable Office Hours",
      "statute_citation": "NDCC 44-04-18(1)",
      "description": "All records of a public entity are public records, open and accessible for inspection during reasonable office hours. If no regular office hours, contact person and phone number must be posted on office door.",
      "conditions": "Open during reasonable office hours; if no regular hours, must post contact information for access; applies unless law provides otherwise",
      "applies_to": "All North Dakota public records",
      "implementation_notes": "Ensures access even for entities without regular hours; posting requirement prevents access denial due to irregular schedules",
      "request_tips": "Request access: 'NDCC 44-04-18(1) opens all records for inspection during reasonable office hours. Please advise your office hours or provide contact information per posting requirement.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Oral or Written Requests / No Motive/Identity Required",
      "statute_citation": "NDCC 44-04-18(2)",
      "description": "Initial request need not be made in person or in writing. Copy must be mailed upon request. Public entity may require written clarification to determine what records requested, but may not ask for motive or reason for requesting or identity of requester.",
      "conditions": "Oral requests accepted; no in-person requirement; agency may request clarification but cannot ask why or who; must mail copies upon request",
      "applies_to": "All public records requests in North Dakota",
      "implementation_notes": "Strong anonymity and informality protections - oral requests OK, identity irrelevant, purpose irrelevant; reduces barriers to access",
      "request_tips": "Assert rights: 'NDCC 44-04-18(2) permits oral requests and prohibits you from asking my motive or identity. Please process this request without requiring in-person submission or purpose/identity disclosure.'"
    },
    {
      "category": "Technology Rights",
      "subcategory": "Automation Shall Not Erode Access",
      "statute_citation": "NDCC 44-04-18(3)",
      "description": "Automation of public records must not erode the right of access to those records. Public entity maintaining electronically stored information may provide information in the electronic form in which it maintains the information.",
      "conditions": "Automation cannot reduce access rights; electronic records provided in maintained format; supports technology facilitating not restricting access",
      "applies_to": "Electronic records in North Dakota",
      "implementation_notes": "Forward-looking provision - prevents agencies from using technology as excuse to restrict access; ensures digital transition increases rather than decreases transparency",
      "request_tips": "For electronic records: 'NDCC 44-04-18(3) prohibits automation from eroding access rights. Please provide these electronic records in the format you maintain them, ensuring technology facilitates my access.'"
    },
    {
      "category": "Fee Waiver",
      "subcategory": "First Hour Search Time Free",
      "statute_citation": "NDCC 44-04-18(4)",
      "description": "Entity may impose fee not exceeding $25 per hour per request for locating records (including electronic), excluding the initial hour, if locating requires more than one hour. Before imposing fee, entity shall provide written fee summary. May require deposit up to 50% of estimated fee.",
      "conditions": "First hour always free; $25/hour maximum after first hour; written fee summary required before charging; 50% deposit allowed",
      "applies_to": "Search and retrieval fees in North Dakota",
      "implementation_notes": "First hour free protects most requests; $25/hour cap keeps fees reasonable; fee summary and deposit limit prevent surprise charges",
      "request_tips": "Challenge search fees: 'NDCC 44-04-18(4) provides first hour of search time free, then maximum $25/hour. Please provide written fee summary before charging and exclude the initial hour from any fees.'"
    },
    {
      "category": "Fee Waiver",
      "subcategory": "25-Cent Per Page Cap",
      "statute_citation": "NDCC 44-04-18(4)",
      "description": "Public entity may charge up to twenty-five cents per impression of a paper copy or the actual per-page cost of copying equipment, whichever amount is greater.",
      "conditions": "25¢ per impression OR actual equipment cost, whichever greater; applies to paper copies",
      "applies_to": "Copying fees in North Dakota",
      "implementation_notes": "Dual standard - 25¢ minimum or actual cost; prevents undercharging agencies while capping reasonable fees",
      "request_tips": "Cite cap: 'NDCC 44-04-18(4) caps copying fees at 25¢ per page or actual equipment cost. Please ensure fees comply with this standard.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "District Court Enforcement with Attorney Fees",
      "statute_citation": "NDCC 44-04-19",
      "description": "Any person denied access may apply to district court in county where record is located for order compelling disclosure. Court shall award reasonable attorney fees and costs to prevailing party.",
      "conditions": "District court jurisdiction; venue in county of record location; mandatory attorney fee award to prevailing party (either side)",
      "applies_to": "Denied access in North Dakota",
      "implementation_notes": "Mandatory fee-shifting to prevailing party incentivizes good faith by both sides; makes enforcement financially viable for legitimate claims",
      "request_tips": "Warn of court action: 'NDCC 44-04-19 permits me to seek court order compelling disclosure. The court must award attorney fees and costs to the prevailing party, making pursuit of my rights financially feasible.'"
    }
  ]
}
