{
  "jurisdiction": {
    "name": "Oregon",
    "slug": "oregon",
    "type": "state",
    "transparency_law": "Oregon Public Records Law"
  },
  "validation_metadata": {
    "parsed_date": "2025-10-10",
    "source_url": "https://www.oregonlegislature.gov/bills_laws/ors/ors192.html",
    "verified_by": "Claude Code AI Assistant",
    "verification_method": "Direct review of ORS Chapter 192",
    "statutory_text_file": "OREGON_transparency_law-v0.11.txt"
  },
  "rights_of_access": [
    {
      "category": "Inspection Rights",
      "subcategory": "Universal Right to Inspect",
      "statute_citation": "ORS 192.314, 192.324(1)",
      "description": "It is the policy of Oregon that every person has a right to inspect any public record of a public body, except as otherwise expressly provided by law. Every public record is open to inspection by any person.",
      "conditions": "Applies to every person; open except when specifically exempted by law; policy declaration supports presumption of access",
      "applies_to": "All public records in Oregon",
      "implementation_notes": "Strong policy statement - every person includes non-residents; 'except as expressly provided' requires specific legal authority to withhold",
      "request_tips": "Assert: 'ORS 192.314 and 192.324(1) establish that every person has the right to inspect public records. Please provide access to [records] under Oregon's policy of openness.'"
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "5-Business-Day Acknowledgment",
      "statute_citation": "ORS 192.329(2)",
      "description": "A public body receiving a request shall provide the requester with an acknowledgment that the public body received the request. The acknowledgment must be provided within five business days of receipt.",
      "conditions": "5 business days for acknowledgment; confirms request received; begins accountability timeline",
      "applies_to": "All written public records requests in Oregon",
      "implementation_notes": "Fast acknowledgment ensures requests not lost; creates paper trail; requester knows request is being processed",
      "request_tips": "Follow up: 'ORS 192.329(2) requires acknowledgment within 5 business days. Please confirm receipt of my request submitted on [date].'"
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "15-Business-Day Response Standard",
      "statute_citation": "ORS 192.329(3)",
      "description": "Public body shall respond as soon as practicable and without unreasonable delay. Response shall not exceed 15 business days following receipt unless public body provides written justification for longer response period.",
      "conditions": "15 business days maximum without justification; must respond as soon as practicable within this cap; written justification required for extensions",
      "applies_to": "Public records requests in Oregon",
      "implementation_notes": "Dual standard - 'as soon as practicable' requires speed, 15-day cap prevents indefinite delay; justification requirement creates accountability for extensions",
      "request_tips": "Cite deadline: 'ORS 192.329(3) requires response within 15 business days as soon as practicable. If you need additional time, please provide written justification.'"
    },
    {
      "category": "Fee Waiver",
      "subcategory": "Public Interest Fee Waiver",
      "statute_citation": "ORS 192.324(3)",
      "description": "A public body may provide copies without charge or at substantially reduced fee if it determines that waiver or reduction is in the public interest because making the record available primarily benefits the general public.",
      "conditions": "Discretionary waiver; must determine public interest benefit; considers whether general public primarily benefits",
      "applies_to": "Requests serving public interest in Oregon",
      "implementation_notes": "Public interest standard encourages transparency for matters benefiting community; agencies should liberally apply for accountability journalism and citizen oversight",
      "request_tips": "Request waiver: 'Making these records available primarily benefits the general public by [explanation]. ORS 192.324(3) permits fee waiver when in public interest. Please waive fees.'"
    },
    {
      "category": "Fee Waiver",
      "subcategory": "Actual Cost Standard with Estimate Requirement",
      "statute_citation": "ORS 192.324(3)",
      "description": "Public bodies may establish fees reasonably calculated to reimburse actual cost of making records available. If fee will exceed $25, must provide written estimate before proceeding.",
      "conditions": "Fees limited to actual costs only; must provide written estimate if over $25; prevents surprise bills",
      "applies_to": "All copying and processing fees in Oregon",
      "implementation_notes": "Actual cost limitation prevents inflated fees; $25 estimate threshold protects requesters from unexpected charges; requester can decline after seeing estimate",
      "request_tips": "Request estimate: 'If fees will exceed $25, ORS 192.324(3) requires written estimate before proceeding. Please provide cost breakdown for my review before beginning work.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "District Attorney / Attorney General Petition",
      "statute_citation": "ORS 192.450",
      "description": "Any person denied the right to inspect or receive a copy may petition the district attorney or Attorney General to review the denial. If they determine record not exempt, they shall order production. If public body refuses, DA/AG may petition court for injunctive relief.",
      "conditions": "File petition with DA or AG; they review and may order disclosure; can seek court enforcement if agency refuses; provides free expert review",
      "applies_to": "Denied public records requests in Oregon",
      "implementation_notes": "Unique dual enforcement - DA (local) or AG (statewide); provides accessible administrative remedy; officials can compel disclosure or litigate",
      "request_tips": "Assert petition right: 'ORS 192.450 permits me to petition the District Attorney or Attorney General to review this denial. They may order disclosure and seek court enforcement. Please reconsider.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Attorney Fee Recovery for Unlawful Denial",
      "statute_citation": "ORS 192.450(4)",
      "description": "If the court determines that the public body has unlawfully refused to permit inspection or copying, the court shall award reasonable attorney fees to the person seeking disclosure if represented by an attorney.",
      "conditions": "Mandatory award if unlawful refusal proven; covers reasonable attorney fees; requires representation by attorney",
      "applies_to": "Successful judicial challenges to unlawful denials",
      "implementation_notes": "Mandatory fee-shifting makes enforcement financially viable; 'unlawful refusal' standard protects against frivolous fee awards while ensuring accountability",
      "request_tips": "Warn of fees: 'If a court determines you unlawfully refused access, ORS 192.450(4) mandates attorney fee award. This makes pursuing judicial review financially feasible for me.'"
    }
  ]
}
