{
  "jurisdiction": {"name": "Maryland", "slug": "maryland", "type": "state", "transparency_law": "Maryland Public Information Act"},
  "validation_metadata": {"parsed_date": "2025-10-16", "source_url": "https://mgaleg.maryland.gov/mgawebsite/Laws/StatuteText?article=ggp&section=4-101", "verified_by": "Forward Worker A-Z", "verification_method": "Complete manual review MD Gen. Prov. § 4-101 et seq.", "statutory_text_file": "statute-full-text.txt"},
  "rights_of_access": [
    {"category": "Timeliness Rights", "subcategory": "30-Day Response Deadline", "statute_citation": "Md. Gen. Prov. § 4-203", "description": "Custodian must grant or deny request within 30 days of receipt. Mandatory deadline creates enforceable timeline.", "conditions": "30 days from receipt; must grant or deny; failure to respond triggers remedies", "applies_to": "All Maryland PIA requests", "implementation_notes": "30-day maximum - among longest state deadlines but still enforceable; silence after 30 days is improper", "request_tips": "Track deadline: 'Md. Gen. Prov. § 4-203 requires response within 30 days. Please confirm expected response date.'"},
    {"category": "Timeliness Rights", "subcategory": "10-Day Extended Timeline Notice", "statute_citation": "Md. Gen. Prov. § 4-203", "description": "If response will take more than 10 working days, custodian must notify requester within 10 days with anticipated timeline, estimated fees, and reason for delay.", "conditions": "Required when response exceeds 10 days; must include timeline, fee estimate, and reason; notification within 10 working days", "applies_to": "Requests requiring extended processing", "implementation_notes": "Prevents surprise delays; requester gets advance notice of timeline and costs", "request_tips": "If delayed: 'Md. Gen. Prov. § 4-203 requires 10-day notice if response takes longer, including timeline, costs, and reasons. Please provide this notification.'"},
    {"category": "Enhanced Access Rights", "subcategory": "Written Denial with Reasons", "statute_citation": "Md. Gen. Prov. § 4-203", "description": "If denied, custodian must provide written statement within 10 working days with reasons for denial and notice of review remedies.", "conditions": "Written statement required; within 10 working days; must explain reasons and remedies", "applies_to": "All denials", "implementation_notes": "Creates documentation trail; informs requester of appeal rights; prevents vague denials", "request_tips": "Demand written denial: 'Md. Gen. Prov. § 4-203 requires written denial within 10 days with specific reasons and notice of my review rights.'"},
    {"category": "Enhanced Access Rights", "subcategory": "Public Access Ombudsman", "statute_citation": "Md. Gen. Prov. § 4-1B-01", "description": "Public Access Ombudsman in Attorney General's Office mediates disputes between requesters and custodians. Free mediation service.", "conditions": "Ombudsman cannot compel action; focuses on conflict resolution; accessible at (410) 576-6560", "applies_to": "All PIA disputes", "implementation_notes": "Effective informal resolution mechanism; should consult before formal board complaint; often resolves issues quickly", "request_tips": "Reference ombudsman: 'I may contact Maryland Public Access Ombudsman at (410) 576-6560 if this issue is not resolved.'"},
    {"category": "Enhanced Access Rights", "subcategory": "PIA Compliance Board Review", "statute_citation": "Md. Gen. Prov. § 4-1A-01", "description": "PIA Compliance Board reviews formal complaints about wrongful denials, unreasonable fees over $350, failure to respond, or bad faith requests. Board can order compliance and assess penalties.", "conditions": "Must consult ombudsman first; board handles formal complaints; can order remedies", "applies_to": "PIA violations - denials, excessive fees, non-response", "implementation_notes": "Formal administrative enforcement; stronger than ombudsman; can issue binding orders", "request_tips": "Escalate if needed: 'After ombudsman consultation, I may file formal complaint with PIA Compliance Board under Md. Gen. Prov. § 4-1A-01.'"},
    {"category": "Fee Waiver", "subcategory": "Reasonable Fee Standard", "statute_citation": "Md. Gen. Prov. § 4-206", "description": "Custodian may charge reasonable fees for search, preparation, and reproduction. Fees must be reasonable and cost-based.", "conditions": "Must be reasonable; based on actual costs; cannot be prohibitive", "applies_to": "All fee-based requests", "implementation_notes": "Reasonableness requirement prevents excessive fees; agencies cannot use fees as barrier", "request_tips": "Challenge excessive fees: 'Md. Gen. Prov. § 4-206 requires reasonable fees. Please provide itemized breakdown justifying these charges as reasonable.'"},
    {"category": "Enhanced Access Rights", "subcategory": "$350 Fee Threshold for Board Review", "statute_citation": "Md. Gen. Prov. § 4-1A-02", "description": "Fees over $350 can be challenged as unreasonable before PIA Compliance Board. Creates accountability for expensive requests.", "conditions": "Applies when fees exceed $350; requester can challenge reasonableness; board reviews and determines", "applies_to": "Requests with fees over $350", "implementation_notes": "Protection against excessive fees; board reviews whether fees reasonable; provides recourse for expensive requests", "request_tips": "Challenge high fees: 'Your fee estimate exceeds $350. Under Md. Gen. Prov. § 4-1A-02, I may seek PIA Compliance Board review of these fees as unreasonable.'"},
    {"category": "Technology Rights", "subcategory": "Electronic Records Included", "statute_citation": "Md. Gen. Prov. § 4-101", "description": "Public records include documentary material in any form including computerized records. Electronic records have same status as paper.", "conditions": "Format-neutral definition; includes all electronic/computerized records", "applies_to": "All recorded government information", "implementation_notes": "Broad definition covers databases, emails, electronic files; agencies cannot deny based on electronic format", "request_tips": "For electronic records: 'Md. Gen. Prov. § 4-101 defines public records to include computerized records. Please provide access to [electronic files/database].'"},
    {"category": "Enhanced Access Rights", "subcategory": "AG Manual and Guidance", "statute_citation": "Md. Gen. Prov. § 4 (AG authority)", "description": "Attorney General publishes comprehensive PIA Manual providing guidance to agencies and requesters. Offers implementation guidance and interpretation.", "conditions": "Manual publicly available; provides authoritative guidance; agencies should follow", "applies_to": "All PIA stakeholders", "implementation_notes": "Detailed guidance available; agencies expected to follow AG manual recommendations; useful reference for requesters", "request_tips": "Reference manual: 'Maryland AG PIA Manual provides guidance on this issue. Please follow AG recommendations for consistent statewide implementation.'"},
    {"category": "Enhanced Access Rights", "subcategory": "Annual Contact Info Requirement", "statute_citation": "Md. Gen. Prov. § 4 (contact provisions)", "description": "Agencies must annually provide PIA contact information to ensure requesters know where to submit requests.", "conditions": "Annual requirement; contact info must be publicly available", "applies_to": "All Maryland public agencies", "implementation_notes": "Ensures accessibility; requesters can easily identify proper contact; reduces misdirected requests", "request_tips": "Request contact: 'Please provide your designated PIA contact information as required by Maryland law.'"}
  ]
}
