{
  "jurisdiction": {
    "slug": "louisiana",
    "name": "Louisiana"
  },
  "rights_of_access": [
    {
      "category": "Proactive Disclosure",
      "subcategory": "Broad Right of Access",
      "statute_citation": "La. R.S. 44:31",
      "description": "Any person of the age of majority may inspect, copy, or reproduce any public record. Louisiana's Public Records Act creates a presumption in favor of public access to government records.",
      "conditions": "Requester must be age of majority (18 or older)",
      "applies_to": "Adults (18+)",
      "implementation_notes": "Louisiana has one of the broadest public records laws in the nation. The presumption is strongly in favor of disclosure.",
      "request_tips": "Cite La. R.S. 44:31: 'Any person of the age of majority may inspect, copy, or reproduce any public record.' The burden is on the agency to justify withholding."
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "Three Business Day Response",
      "statute_citation": "La. R.S. 44:32",
      "description": "The custodian must respond to a request within three business days (excluding Saturdays, Sundays, and legal holidays). If records are in active use, the custodian must certify this in writing and set a day and hour within three days for access.",
      "conditions": "Three business days from receipt of request",
      "applies_to": "All requesters",
      "implementation_notes": "The response requirement is to respond in some fashion, not necessarily to produce all records within three days. But the custodian must acknowledge the request and provide a timeline.",
      "request_tips": "Track the three business day deadline. If no response, send follow-up: 'La. R.S. 44:32 requires a response within three business days. Please respond immediately with status of my request or a timeline for production.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Free Inspection and Digital Copies",
      "statute_citation": "La. R.S. 44:32",
      "description": "There is no cost to inspect public records or make digital copies during regular working hours. Custodians cannot charge for inspection or for digital/electronic copies.",
      "conditions": "Applies during regular business hours",
      "applies_to": "All requesters",
      "implementation_notes": "Louisiana law explicitly states no cost for inspection or digital copies. Only paper copies may incur fees.",
      "request_tips": "Request records in digital format and cite La. R.S. 44:32: 'There shall be no cost to inspect or make digital copies of a public record during regular working hours.' Insist on free electronic delivery."
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Fee Schedule - 25 Cents Per Page",
      "statute_citation": "La. R.S. 44:32",
      "description": "State agencies must charge a uniform fee determined by the Commissioner of Administration. The recommended fee is 25 cents per page for standard-size copies and actual cost for other sizes.",
      "conditions": "Applies to paper copies only; digital copies are free",
      "applies_to": "All requesters",
      "implementation_notes": "The 25-cent fee is the standard, but always request digital copies first to avoid any fees.",
      "request_tips": "Request: 'Please provide records in digital format at no cost per La. R.S. 44:32. If paper copies are necessary, the fee should not exceed 25 cents per page as recommended by the Commissioner of Administration.'"
    },
    {
      "category": "Technology Rights",
      "subcategory": "Electronically Stored Information Included",
      "statute_citation": "La. R.S. 44:1 (amended 2022)",
      "description": "The definition of 'public record' expressly includes electronically stored information and information contained in databases or electronic data processing equipment, regardless of physical form or characteristics.",
      "conditions": "Applies to all electronic records and databases",
      "applies_to": "All requesters",
      "implementation_notes": "The 2022 amendment ensures that agencies cannot claim electronic information is not a 'record.' Databases, emails, and all ESI are covered.",
      "request_tips": "If an agency claims electronic data is not a record, cite the 2022 amendment to La. R.S. 44:1: 'Public records expressly include electronically stored information, regardless of physical form or characteristics.'"
    },
    {
      "category": "Technology Rights",
      "subcategory": "Electronic Means Preferred - No Additional Cost",
      "statute_citation": "La. R.S. 44:32",
      "description": "Records maintained on computer systems should be provided by electronic means where possible at no additional cost. Agencies cannot charge extra for electronic delivery.",
      "conditions": "Applies when records are maintained electronically",
      "applies_to": "All requesters",
      "implementation_notes": "Electronic delivery via email or download should be the default. Paper copies should only be used when electronic is not feasible.",
      "request_tips": "Request: 'Please provide all responsive records electronically via email or download link at no cost, as required when records are maintained on computer systems per La. R.S. 44:32.'"
    },
    {
      "category": "Technology Rights",
      "subcategory": "Social Media and Private Accounts Are Public Records",
      "statute_citation": "La. R.S. 44:1",
      "description": "Public business communications conducted on private email accounts, devices, and social media platforms are public records. Text messages used in the performance of government work are also public records.",
      "conditions": "Content must relate to government business, regardless of platform",
      "applies_to": "All requesters",
      "implementation_notes": "Louisiana courts have affirmed that the use of private platforms for public business does not shield records from disclosure. The content, not the platform, determines public record status.",
      "request_tips": "Include in requests: 'Please search all platforms where government business is conducted, including private email accounts, text messages, and social media, as these are public records under La. R.S. 44:1 regardless of the platform used.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Custodian Must Provide Assistance",
      "statute_citation": "La. R.S. 44:32",
      "description": "Custodians must provide reasonable estimates of completion time and offer answers to help requesters find the records they seek. Agencies have a duty to assist requesters.",
      "conditions": "Applies to all requests",
      "applies_to": "All requesters",
      "implementation_notes": "If you're not sure exactly what to request, the custodian must help you identify the right records. They cannot simply deny a request for being too vague without offering assistance.",
      "request_tips": "If an agency claims your request is unclear, respond: 'Under La. R.S. 44:32, the custodian must provide answers to help me find the records I seek. Please suggest how I should refine my request or describe what records you maintain related to [subject].'"
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "Active Use Certification",
      "statute_citation": "La. R.S. 44:32",
      "description": "If records are in active use when requested, the custodian must promptly certify this in writing and fix a day and hour within three days for access. The requester is entitled to know when records will be available.",
      "conditions": "Applies when records are in active use",
      "applies_to": "All requesters",
      "implementation_notes": "Active use is a temporary condition. The custodian must commit to a specific time for access, not an indefinite delay.",
      "request_tips": "If told records are in active use, request written certification per La. R.S. 44:32 specifying the exact day and hour within three business days when records will be available."
    },
    {
      "category": "Requester-Specific Rights",
      "subcategory": "No Purpose Statement Required",
      "statute_citation": "La. R.S. 44:31",
      "description": "Requesters are not required to state the purpose of their request or explain why they want records. Louisiana's Public Records Act is requester-blind.",
      "conditions": "No conditions on requester identity or purpose",
      "applies_to": "All requesters",
      "implementation_notes": "Agencies sometimes ask why you want records. This is not required and should not affect whether records are disclosed.",
      "request_tips": "If asked for your purpose, respond: 'Louisiana law does not require me to state the purpose of my request. La. R.S. 44:31 grants the right to access records without regard to the requester's purpose.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Prompt Production Requirement",
      "statute_citation": "La. R.S. 44:32",
      "description": "Custodians must present public records 'promptly' upon request. While three days is allowed for a response, simple requests should be fulfilled immediately when records are readily available.",
      "conditions": "Applies to readily available records",
      "applies_to": "All requesters",
      "implementation_notes": "For routine requests (e.g., a specific document you can identify), agencies should not take the full three days. 'Promptly' means without unnecessary delay.",
      "request_tips": "For simple requests, note: 'This is a routine request for readily available records. La. R.S. 44:32 requires prompt production. I expect these records to be available immediately or within hours, not the full three business days.'"
    },
    {
      "category": "Inspection Rights",
      "subcategory": "Right to Inspect Before Copying",
      "statute_citation": "La. R.S. 44:31",
      "description": "Requesters have the right to inspect records before deciding which to copy or reproduce. This allows review of voluminous records to select only what is needed.",
      "conditions": "Inspection allowed during regular business hours",
      "applies_to": "All requesters",
      "implementation_notes": "Inspection is especially valuable for large sets of records where you want to review first. Bringing a camera or phone to photograph during inspection may be permitted.",
      "request_tips": "Include: 'I request the opportunity to inspect responsive records before copying. This will allow me to select only the records I need and minimize costs per La. R.S. 44:31.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Judicial Review Available",
      "statute_citation": "La. R.S. 44:35",
      "description": "Requesters may seek judicial review through mandamus or other appropriate remedy when agencies improperly deny access. Courts can order production and may award attorney fees.",
      "conditions": "Available when agency violates the Act",
      "applies_to": "All requesters",
      "implementation_notes": "Louisiana courts have consistently ruled in favor of broad access. Attorney fees are available to prevailing plaintiffs, making enforcement more accessible.",
      "request_tips": "If denied, document everything. Louisiana courts favor disclosure. Consult an attorney about mandamus relief and potential fee recovery under La. R.S. 44:35."
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Uniform Fee Structure",
      "statute_citation": "La. R.S. 44:32",
      "description": "State agencies must use a uniform fee schedule determined by the Commissioner of Administration. Agencies cannot create their own fee structures or charge arbitrary amounts.",
      "conditions": "Applies to all state agencies",
      "applies_to": "All requesters",
      "implementation_notes": "If an agency quotes fees that seem high or inconsistent, check the Commissioner's official fee schedule. Arbitrary fees violate the uniform requirement.",
      "request_tips": "If fees seem excessive, ask: 'Please provide a breakdown showing compliance with the uniform fee schedule mandated by La. R.S. 44:32 and established by the Commissioner of Administration.'"
    },
    {
      "category": "Technology Rights",
      "subcategory": "Database Access Rights",
      "statute_citation": "La. R.S. 44:1",
      "description": "Information contained in databases or electronic data processing equipment is explicitly covered as public records. Requesters can access structured data, not just document outputs.",
      "conditions": "Applies to all database systems",
      "applies_to": "All requesters",
      "implementation_notes": "Agencies sometimes offer to provide printouts of database information when the actual structured data would be more useful. Request the underlying data.",
      "request_tips": "Request: 'Please provide the responsive database records in structured format (CSV, Excel, or database export) rather than printouts. La. R.S. 44:1 includes information contained in databases as public records.'"
    }
  ],
  "validation_metadata": {
    "parsed_date": "2025-10-07",
    "source_url": "https://legis.la.gov/legis/Laws_Toc.aspx?folder=118&title=44",
    "source_verified": true,
    "primary_sources": [
      "Louisiana Revised Statutes Title 44 (legis.la.gov)",
      "Louisiana Department of Justice Public Records Law Presentation",
      "National Freedom of Information Coalition - Louisiana Resources",
      "Ballotpedia Louisiana FOIA Procedures"
    ],
    "verification_notes": "All rights verified against La. R.S. 44:1 et seq. as of October 2025. Louisiana amended the definition of public records in 2022 to explicitly include electronically stored information. No cost for inspection or digital copies is a unique strength of Louisiana law.",
    "rights_count": 15,
    "categories_covered": [
      "Proactive Disclosure",
      "Timeliness Rights",
      "Enhanced Access Rights",
      "Technology Rights",
      "Requester-Specific Rights",
      "Inspection Rights",
      "Appeal Rights"
    ]
  }
}
