{
  "jurisdiction": {
    "slug": "virginia",
    "name": "Virginia"
  },
  "rights_of_access": [
    {
      "category": "Proactive Disclosure",
      "subcategory": "Presumption of Openness",
      "statute_citation": "Va. Code Ann. § 1.01",
      "description": "Virginia law establishes a presumption that all government records are open to public inspection unless specifically exempted. Government agencies must interpret the public records law broadly to favor disclosure.",
      "conditions": "Applies to all government agencies in Virginia. Exemptions must be narrowly construed.",
      "applies_to": "General public",
      "implementation_notes": "Agencies should release records unless a specific exemption clearly applies. Doubtful cases should be resolved in favor of disclosure.",
      "request_tips": "In your request, cite the presumption of openness and note that exemptions must be narrowly construed. If denied, ask the agency to explain which specific exemption applies."
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "Response Deadline",
      "statute_citation": "Va. Code Ann. § 2.03",
      "description": "Agencies must respond to public records requests within a reasonable time period, typically defined by statute or court decisions. Initial acknowledgment and final response deadlines are established by law.",
      "conditions": "Statutory timelines may vary based on request complexity. Extensions may be permitted in certain circumstances.",
      "applies_to": "All requesters",
      "implementation_notes": "Track response timelines carefully. If the agency misses deadlines, document this for any future appeals or litigation.",
      "request_tips": "In your request, ask for acknowledgment within the statutory timeframe and request an estimated completion date. If deadlines are missed, send a follow-up citing the statutory timeline requirement."
    },
    {
      "category": "Fee Waiver",
      "subcategory": "Fee Limitations",
      "statute_citation": "Va. Code Ann. § 3.05",
      "description": "Virginia law limits fees that agencies may charge for public records. Agencies may charge only for actual costs of duplication and may not charge for staff time to review or redact records in most cases. Fee waivers are available when disclosure serves the public interest.",
      "conditions": "Fee waivers typically available for news media, researchers, and requests serving public interest. Agencies must itemize all fees charged.",
      "applies_to": "All requesters; waivers for media, researchers, public interest requests",
      "implementation_notes": "Request an itemized fee estimate before the agency proceeds with processing. Challenge any fees that exceed statutory limits.",
      "request_tips": "Request a fee waiver if your request serves the public interest or you are affiliated with news media or educational institutions. State: 'I request a fee waiver under Va. Code Ann. § 3.05 as this request serves the public interest by [explain how disclosure benefits the public].'"
    },
    {
      "category": "Technology Rights",
      "subcategory": "Electronic Format",
      "statute_citation": "Va. Code Ann. § 4.02",
      "description": "Requesters have the right to receive records in electronic format when the agency maintains records electronically. Agencies must provide records in the format requested if readily available in that format.",
      "conditions": "Agency must provide electronic records if maintained electronically and no additional programming is required.",
      "applies_to": "All requesters",
      "implementation_notes": "Electronic delivery often reduces costs and expedites processing. Native file formats (Excel, Word) are preferable to PDFs for data analysis.",
      "request_tips": "Include in your request: 'I request all responsive records in electronic format, preferably in their native file format (Excel, Word, etc.) or as searchable PDFs. Electronic delivery via email or download link is preferred.'"
    },
    {
      "category": "Inspection Rights",
      "subcategory": "In-Person Inspection",
      "statute_citation": "Va. Code Ann. § 5.01",
      "description": "Virginia law provides the right to inspect public records in person at the agency's office during regular business hours. This allows requesters to review records before deciding which to copy, potentially reducing costs.",
      "conditions": "Agency must make records available for inspection during regular business hours. May require reasonable advance notice.",
      "applies_to": "All requesters",
      "implementation_notes": "For voluminous records, inspection before copying can save significant costs. Bring a device to photograph records if permitted.",
      "request_tips": "If requesting extensive records, include: 'I request the opportunity to inspect the responsive records at your office before determining which records I wish to receive in copy form. Please advise available times for inspection.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Segregability Requirement",
      "statute_citation": "Va. Code Ann. § 6.04",
      "description": "When portions of a record are exempt from disclosure, the agency must redact only the exempt portions and release the remainder. Agencies cannot withhold entire documents when portions are releasable.",
      "conditions": "Mandatory requirement whenever records contain both exempt and non-exempt information.",
      "applies_to": "All requesters",
      "implementation_notes": "The segregability requirement is not discretionary. Agencies must conduct a page-by-page, line-by-line review to release all non-exempt information.",
      "request_tips": "When records are redacted, respond: 'I request release of all reasonably segregable portions of any withheld records as required by Va. Code Ann. § 6.04. Please provide a detailed explanation for each redaction.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Written Denial with Justification",
      "statute_citation": "Va. Code Ann. § 7.02",
      "description": "Agencies must provide written denials that cite the specific statutory exemption and explain why it applies to each withheld record. Generic or conclusory denials are insufficient.",
      "conditions": "Required for all denials, whether full or partial. Must cite specific statutory authority.",
      "applies_to": "All requesters",
      "implementation_notes": "Inadequate denial letters can be challenged in court. Denials should reference specific exemption provisions and explain application to particular records.",
      "request_tips": "If denied access, request a written explanation that cites the specific statutory exemption and explains how it applies to each withheld record. Generic denials citing broad categories are legally insufficient."
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Attorney Fee Recovery",
      "statute_citation": "Va. Code Ann. § 8.06",
      "description": "Courts may award attorney fees and litigation costs to requesters who prevail in lawsuits to compel disclosure. This provision encourages agencies to comply with the law and provides recourse for improperly denied requests.",
      "conditions": "Typically available when requester substantially prevails in litigation. Court has discretion based on circumstances.",
      "applies_to": "Requesters who file lawsuits and prevail",
      "implementation_notes": "Fee awards are often available even when agencies release records after litigation commences. Document all agency violations for potential fee recovery.",
      "request_tips": "If considering legal action, consult an attorney about potential fee recovery under Va. Code Ann. § 8.06. Courts often award fees when agencies improperly withhold records or violate procedural requirements."
    },
    {
      "category": "Requester-Specific Rights",
      "subcategory": "No Identity or Purpose Requirement",
      "statute_citation": "Va. Code Ann. § 9.01",
      "description": "Virginia law does not require requesters to identify themselves beyond providing contact information for the agency's response, nor must requesters state the purpose of their request. The public records law is requester-blind.",
      "conditions": "No conditions - requests must be processed regardless of requester identity or purpose.",
      "applies_to": "All persons, including out-of-state residents and organizations",
      "implementation_notes": "While contact information may be needed for the agency to respond, requesters need not provide extensive personal details or justify their interest.",
      "request_tips": "You are not required to explain why you want records or provide personal information beyond what is needed for the agency to respond. If an agency demands unnecessary information, cite this provision."
    },
    {
      "category": "Requester-Specific Rights",
      "subcategory": "No Residency Restriction",
      "statute_citation": "Va. Code Ann. § 9.02",
      "description": "Virginia public records law applies to all persons regardless of residency. Out-of-state residents, citizens of other countries, and organizations have the same rights as state residents.",
      "conditions": "No residency restrictions. Same rights apply to all requesters.",
      "applies_to": "All persons regardless of residency or citizenship",
      "implementation_notes": "Some states historically imposed residency requirements, but most have eliminated these restrictions or courts have found them unconstitutional.",
      "request_tips": "If you are an out-of-state resident and the agency suggests this affects your rights, cite Va. Code Ann. § 9.02 and note that public records laws apply equally to all persons."
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Administrative Appeal",
      "statute_citation": "Va. Code Ann. § 10.03",
      "description": "Requesters have the right to appeal denials to a higher authority within the agency or to an independent oversight body. The appeal process provides an opportunity to challenge improper denials before resorting to litigation.",
      "conditions": "Appeal deadlines and procedures vary by jurisdiction. Typically must exhaust administrative remedies before filing suit.",
      "applies_to": "All requesters who receive denials",
      "implementation_notes": "File appeals promptly to preserve rights. Document all communications during the appeal process.",
      "request_tips": "If your request is denied, immediately file an administrative appeal citing Va. Code Ann. § 10.03. In your appeal, explain why the denial is improper and request a detailed reconsideration. Preserve your right to judicial review by exhausting administrative remedies."
    },
    {
      "category": "Proactive Disclosure",
      "subcategory": "Public Records Officer",
      "statute_citation": "Va. Code Ann. § 11.01",
      "description": "Agencies must designate a public records officer or coordinator responsible for processing public records requests. Contact information for this officer must be publicly available.",
      "conditions": "Required for all agencies subject to public records law.",
      "applies_to": "General public seeking records",
      "implementation_notes": "If you cannot identify the proper records officer, contact the agency's main office and ask for the designated public records coordinator.",
      "request_tips": "Direct your request to the agency's designated public records officer. If you cannot identify this person, call the agency and ask for contact information for the public records coordinator."
    },
    {
      "category": "Technology Rights",
      "subcategory": "Database Access",
      "statute_citation": "Va. Code Ann. § 12.04",
      "description": "When agencies maintain records in electronic databases, requesters may access the database records or request data in structured formats suitable for analysis. Agencies cannot refuse requests merely because they require database queries or electronic processing.",
      "conditions": "Agency must provide database records unless request requires creating new records or extensive programming. Structured formats must be provided if readily available.",
      "applies_to": "All requesters",
      "implementation_notes": "Request data in machine-readable formats like CSV, JSON, or Excel. Agencies cannot charge excessive fees for electronic processing that simply exports existing data.",
      "request_tips": "For database records, request: 'Please provide responsive records from your database in a structured, machine-readable format such as CSV or Excel. I am requesting existing data fields and do not seek creation of new records or custom programming.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Proper Redaction Standards",
      "statute_citation": "Va. Code Ann. § 13.05",
      "description": "When agencies redact portions of records, they must use proper redaction techniques that clearly indicate where information has been removed and cite the specific exemption for each redaction. Redactions must be limited to only the exempt information.",
      "conditions": "Applies to all redacted records. Agencies must provide redaction logs or explanations for significant redactions.",
      "applies_to": "All requesters receiving redacted records",
      "implementation_notes": "Proper redactions show clearly where information has been removed and often include marginal notations citing the exemption. Excessive or unexplained redactions may be challengeable.",
      "request_tips": "If you receive heavily redacted records, request a detailed explanation: 'Please provide a redaction log identifying each redaction, the specific statutory exemption claimed, and an explanation of how the exemption applies to the redacted information.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Judicial Enforcement",
      "statute_citation": "Va. Code Ann. § 14.07",
      "description": "Requesters may seek judicial enforcement of public records rights through court action. Courts have authority to order disclosure, impose penalties on agencies for violations, and award attorney fees to prevailing requesters.",
      "conditions": "Typically must exhaust administrative remedies before filing suit. Statutory deadlines may apply for court actions.",
      "applies_to": "Requesters who have exhausted administrative appeals",
      "implementation_notes": "Consult an attorney if considering litigation. Courts can impose significant penalties on agencies that willfully violate public records laws.",
      "request_tips": "If administrative appeals fail to produce records, consult an attorney about filing suit under Va. Code Ann. § 14.07. Document all agency violations, missed deadlines, and improper denials to support your case."
    }
  ],
  "validation_metadata": {
    "parsed_date": "2025-10-07",
    "source_url": "https://www.placeholder-for-virginia-statutes.gov",
    "source_verified": false,
    "primary_sources": [
      "Virginia Public Records Law (official state code website)",
      "Virginia Attorney General FOIA guidance",
      "Virginia state legislature official website"
    ],
    "verification_notes": "TEMPLATE GENERATED - These rights represent common patterns found across state public records laws but have NOT been verified against official Virginia statutes. All citations, descriptions, and request tips must be verified and updated from official .gov sources before use. This is a starting template only.",
    "rights_count": 15,
    "categories_covered": [
      "Proactive Disclosure",
      "Timeliness Rights",
      "Fee Waiver",
      "Technology Rights",
      "Inspection Rights",
      "Enhanced Access Rights",
      "Appeal Rights",
      "Requester-Specific Rights"
    ],
    "template_version": "v0.12",
    "requires_verification": true,
    "verification_status": "UNVERIFIED TEMPLATE"
  }
}
