{
  "jurisdiction": {
    "name": "Rhode Island",
    "slug": "rhode-island",
    "type": "state",
    "transparency_law": "Rhode Island Access to Public Records Act (APRA)"
  },
  "validation_metadata": {
    "parsed_date": "2025-10-10",
    "source_url": "https://webserver.rilegislature.gov/Statutes/TITLE38/38-2/INDEX.HTM",
    "verified_by": "Claude Code AI Assistant",
    "verification_method": "Direct review of RIGL Chapter 38-2",
    "statutory_text_file": "RHODE_ISLAND_transparency_law-v0.11.txt"
  },
  "rights_of_access": [
    {
      "category": "Inspection Rights",
      "subcategory": "Right to Inspect and Copy",
      "statute_citation": "RIGL § 38-2-3(a)",
      "description": "Every person or entity shall have the right to inspect and/or copy public records at such reasonable time as may be determined by the custodian. All records are presumed public unless specifically exempted.",
      "conditions": "Applies to all persons and entities; at reasonable times determined by custodian; presumption of public access",
      "applies_to": "All public records in Rhode Island",
      "implementation_notes": "Dual right to inspect AND copy; no residency requirement; 'entity' includes organizations and businesses",
      "request_tips": "Assert: 'RIGL § 38-2-3(a) grants me the right to inspect and copy [records]. Please provide access at a reasonable time under this statutory presumption of openness.'"
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "10-Business-Day Inspection Deadline",
      "statute_citation": "RIGL § 38-2-3(f)",
      "description": "A public body receiving a request shall permit the inspection or copying within ten (10) business days after receiving a request. If not permitted within 10 business days, the public body shall forthwith explain in writing the need for additional time.",
      "conditions": "10 business days maximum for initial response; must provide written explanation if additional time needed",
      "applies_to": "All public records requests in Rhode Island",
      "implementation_notes": "Business days, not calendar days; written explanation required for any delay beyond 10 days",
      "request_tips": "Cite deadline: 'RIGL § 38-2-3(f) requires inspection within 10 business days. If you need additional time, please provide written explanation forthwith.'"
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "Additional 20-Day Extension for Voluminous Requests",
      "statute_citation": "RIGL § 38-2-3(g)",
      "description": "Public body may have up to an additional twenty (20) business days to comply if it can demonstrate that the voluminous nature, number of pending requests, or difficulty in searching/retrieving/copying is such that additional time is necessary to avoid imposing undue burden on the public body.",
      "conditions": "Extension limited to 20 additional business days (total 30 business days); requires demonstration of voluminous nature, pending requests backlog, or retrieval difficulty; must show undue burden without extension",
      "applies_to": "Complex or voluminous requests in Rhode Island",
      "implementation_notes": "Total maximum 30 business days (~6 weeks); agency must affirmatively demonstrate need for extension; protects agencies from undue burden while capping delays",
      "request_tips": "If extended: 'RIGL § 38-2-3(g) permits 20 additional business days only if you demonstrate voluminous nature, pending backlog, or difficulty creates undue burden. Please provide this demonstration.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "No Purpose Statement Required",
      "statute_citation": "RIGL § 38-2-3(j)",
      "description": "No public body shall require a statement of purpose as a condition for making requests for public records available nor shall the public body withhold public records from disclosure because of the intended purpose of making the request.",
      "conditions": "Absolute prohibition on requiring purpose statements; cannot consider intended use when evaluating request; applies to all requests",
      "applies_to": "All public records requests in Rhode Island",
      "implementation_notes": "Strong requester protection - purpose irrelevant to access rights; prevents agencies from discriminating based on requester motivation",
      "request_tips": "Assert: 'RIGL § 38-2-3(j) prohibits you from requiring a purpose statement or considering my intended use. Please process this request without purpose inquiry.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Segregability Requirement",
      "statute_citation": "RIGL § 38-2-3(b)",
      "description": "Any reasonably segregable portion of a public record excluded by exemptions shall be available for public inspection after deletion of information which is the basis of exclusion. If entire document deemed non-public, public body shall state in writing that no portion contains reasonable segregable releasable information.",
      "conditions": "Mandatory segregation of public from exempt; must delete only exempt portions; if entire document withheld, must certify in writing no segregable information exists",
      "applies_to": "Records containing both public and exempt information",
      "implementation_notes": "Strong segregability requirement; written certification required for full withholding prevents blanket denials; supports maximum disclosure",
      "request_tips": "Assert segregability: 'RIGL § 38-2-3(b) requires you to provide reasonably segregable portions. If withholding entire document, you must state in writing that no segregable information exists.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Agency Procedures and Website Posting",
      "statute_citation": "RIGL § 38-2-3(d)",
      "description": "Each public body shall adopt written procedures regarding public access to its public records including: identification of designated public records officer or unit, how to make requests, where requests should be made. Procedures shall be posted on agency website if maintained and made otherwise readily available to the public.",
      "conditions": "Mandatory written procedures; must identify records officer/unit; must explain request process; website posting if site exists; must be readily available",
      "applies_to": "All Rhode Island public bodies",
      "implementation_notes": "Transparency about transparency - ensures requesters know how to exercise rights; readily available procedures reduce access barriers",
      "request_tips": "Request procedures: 'RIGL § 38-2-3(d) requires you to post written procedures for public records access. Please direct me to your posted procedures including designated records officer contact.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Format Preference Rights",
      "statute_citation": "RIGL § 38-2-3(i)",
      "description": "At the election of the person or entity requesting public records, the public body shall provide copies electronically, by facsimile, or by mail in accordance with requester's choice, unless complying would be unduly burdensome due to volume or costs. Person requesting delivery responsible for actual cost of delivery.",
      "conditions": "Requester chooses format (electronic/fax/mail); agency must accommodate unless unduly burdensome; requester pays actual delivery costs only",
      "applies_to": "All copy delivery methods in Rhode Island",
      "implementation_notes": "Requester controls delivery method; agencies cannot force inconvenient delivery absent undue burden; actual cost standard prevents inflated delivery fees",
      "request_tips": "Specify format: 'Under RIGL § 38-2-3(i), I elect to receive copies [electronically/by mail/by fax]. Please accommodate this format choice and charge only actual delivery costs.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Active Use/Storage Accommodation",
      "statute_citation": "RIGL § 38-2-3(h)",
      "description": "If a public record is in active use or in storage and therefore not available when requested, the custodian shall so inform the requester and make an appointment for examination as expeditiously as they may be made available.",
      "conditions": "Applies when records in active use or storage; custodian must inform requester; must schedule access expeditiously",
      "applies_to": "Requests for records temporarily unavailable",
      "implementation_notes": "Prevents denial based on temporary unavailability; requires agencies to schedule access rather than deny; supports eventual access even for archived records",
      "request_tips": "If unavailable: 'RIGL § 38-2-3(h) requires you to inform me of unavailability and make an appointment for examination as expeditiously as records can be made available. Please schedule access.'"
    },
    {
      "category": "Fee Waiver",
      "subcategory": "15-Cent Per Page Cap",
      "statute_citation": "RIGL § 38-2-4(a)",
      "description": "The public body may charge a fee for copies that shall not exceed fifteen cents ($.15) per page.",
      "conditions": "Maximum 15¢ per page; no exceptions to cap; applies to all copying fees",
      "applies_to": "All copy fees in Rhode Island",
      "implementation_notes": "Very low fee cap keeps costs minimal; prevents excessive fees from being access barrier",
      "request_tips": "Cite cap: 'RIGL § 38-2-4(a) caps copy fees at 15¢ per page. Please ensure your fees comply with this statutory limit.'"
    },
    {
      "category": "Fee Waiver",
      "subcategory": "First Hour Search Time Free",
      "statute_citation": "RIGL § 38-2-4(b)",
      "description": "If complying with a request requires more than one (1) hour of search or retrieval time, the public body may charge for personnel costs associated with the time required, based upon the lowest paid employee capable of performing the task. The charge shall not exceed fifteen dollars ($15.00) per hour and shall not include the first hour of search time.",
      "conditions": "First hour always free; subsequent hours up to $15/hour maximum; must use lowest paid capable employee for calculation; applies only to search/retrieval time over 1 hour",
      "applies_to": "Search and retrieval fees in Rhode Island",
      "implementation_notes": "First hour free protects routine requests; $15/hour cap and lowest-paid-employee standard keep fees reasonable even for complex requests",
      "request_tips": "Challenge search fees: 'RIGL § 38-2-4(b) provides first hour of search time free, then maximum $15/hour using lowest paid capable employee. Please ensure fees comply with these limits.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Attorney General Complaint Process",
      "statute_citation": "RIGL § 38-2-8",
      "description": "Any person denied access may file complaint with Attorney General on forms provided by AG. AG is charged with investigating complaints. Upon determining unlawful denial, AG may institute proceedings in superior court to compel access.",
      "conditions": "File complaint with AG; AG investigates; AG may bring court action for unlawful denials; provides free administrative review",
      "applies_to": "Denied public records requests in Rhode Island",
      "implementation_notes": "AG serves as advocate for requesters; free expert review; AG can litigate on requester's behalf for significant violations",
      "request_tips": "Assert AG complaint right: 'RIGL § 38-2-8 permits me to file a complaint with the Attorney General, who must investigate and may bring court action. Please reconsider to avoid AG involvement.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Superior Court Mandamus",
      "statute_citation": "RIGL § 38-2-5 and § 38-2-9",
      "description": "Any person denied access may apply to superior court for writ of mandamus to compel compliance. Superior court has jurisdiction to order disclosure of improperly withheld records regardless of where public body is located. If court determines denial was arbitrary or capricious, may impose civil fine up to $1,000 per violation.",
      "conditions": "File in superior court; statewide venue (any location regardless of body's location); mandamus available; civil fines up to $1,000 for arbitrary/capricious denials",
      "applies_to": "APRA violations in Rhode Island",
      "implementation_notes": "Flexible venue facilitates access to justice; mandamus provides direct remedy; meaningful fines deter arbitrary denials",
      "request_tips": "Warn of court action: 'RIGL §§ 38-2-5 and 38-2-9 authorize superior court mandamus with civil fines up to $1,000 for arbitrary or capricious denials. Please comply to avoid judicial intervention.'"
    }
  ]
}
