{
  "jurisdiction": {
    "name": "South Carolina",
    "slug": "south-carolina",
    "type": "state",
    "transparency_law": "South Carolina Freedom of Information Act"
  },
  "validation_metadata": {
    "parsed_date": "2025-10-10",
    "source_url": "https://www.scstatehouse.gov/code/t30c004.php",
    "verified_by": "Claude Code AI Assistant",
    "verification_method": "Direct review of SC Code Title 30, Chapter 4",
    "statutory_text_file": "SOUTH_CAROLINA_transparency_law-v0.11.txt"
  },
  "rights_of_access": [
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Liberal Construction Mandate",
      "statute_citation": "SC Code § 30-4-110(A)",
      "description": "This chapter must be construed liberally in favor of openness. This establishes South Carolina's strong presumption favoring transparency.",
      "conditions": "Applies to all FOIA interpretations; courts and agencies must construe law broadly favoring disclosure",
      "applies_to": "All South Carolina FOIA matters",
      "implementation_notes": "Explicit liberal construction requirement - ambiguities resolved in favor of access; supports maximum disclosure principle",
      "request_tips": "Cite mandate: 'SC Code § 30-4-110(A) requires liberal construction in favor of openness. Any ambiguity must be resolved favoring disclosure of [records].'"
    },
    {
      "category": "Inspection Rights",
      "subcategory": "Universal Right to Inspect or Copy",
      "statute_citation": "SC Code § 30-4-30(A)",
      "description": "Any person has a right to inspect or copy any public record of a public body, except as otherwise provided by exemptions, in accordance with reasonable rules concerning time and place of access.",
      "conditions": "Applies to any person; reasonable time and place rules; subject only to statutory exemptions",
      "applies_to": "All public records in South Carolina",
      "implementation_notes": "No residency requirement - 'any person' includes non-residents; dual right to inspect OR copy provides flexibility",
      "request_tips": "Assert: 'SC Code § 30-4-30(A) grants any person the right to inspect or copy public records. Please provide access to [records] under this statutory right.'"
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "15-Calendar-Day Response Requirement",
      "statute_citation": "SC Code § 30-4-30(C)",
      "description": "A public body shall respond to a request within fifteen calendar days by providing the record, providing a written explanation for delay in providing the record, or providing written explanation stating the basis for refusal to provide the record.",
      "conditions": "15 calendar days (not business days) for response; must provide records, explain delay, or deny with basis; response must be substantive",
      "applies_to": "All FOIA requests in South Carolina",
      "implementation_notes": "Calendar days, not business days - approximately 2 weeks; response options preserve transparency even when delays occur",
      "request_tips": "Cite deadline: 'SC Code § 30-4-30(C) requires response within 15 calendar days. Please confirm receipt and respond by providing records, explaining any delay, or stating refusal basis.'"
    },
    {
      "category": "Timeliness Rights",
      "subcategory": "30-Calendar-Day Production Standard",
      "statute_citation": "SC Code § 30-4-30(D)",
      "description": "If a request for records is granted, the records shall be furnished as promptly as reasonably possible, but no later than thirty calendar days from the date of the request, unless the request is for records that are more than twenty-four months old, in which case the public body has up to thirty-five calendar days to furnish the records.",
      "conditions": "30 calendar days maximum for current records (under 24 months old); 35 calendar days for older records (24+ months); must furnish promptly as reasonably possible within these maximums",
      "applies_to": "Granted FOIA requests in South Carolina",
      "implementation_notes": "Clear maximum deadlines; older records get additional 5 days recognizing retrieval challenges; 'as promptly as reasonably possible' requires production before deadline when feasible",
      "request_tips": "For current records: 'SC Code § 30-4-30(D) requires records furnished within 30 calendar days, as promptly as reasonably possible. Please provide by [specific date within 30 days].' For old records: 'These records are over 24 months old, giving you 35 calendar days under SC Code § 30-4-30(D).'"
    },
    {
      "category": "Fee Waiver",
      "subcategory": "Actual Cost Standard",
      "statute_citation": "SC Code § 30-4-30(B)",
      "description": "A public body may establish fees for the actual costs of search, retrieval, and reproduction of records. If the cost of reproduction is greater than twenty-five dollars, the public body may require a deposit not exceeding twenty-five percent of the estimated cost prior to searching for or reproducing the records.",
      "conditions": "Fees limited to actual costs only; covers search, retrieval, and reproduction; deposit up to 25% when cost exceeds $25",
      "applies_to": "All fee charges for South Carolina public records",
      "implementation_notes": "Actual cost limitation prevents inflated fees; deposit mechanism protects agencies from non-payment but capped at reasonable 25%; must provide cost estimate justifying deposit",
      "request_tips": "Challenge excessive fees: 'SC Code § 30-4-30(B) limits fees to actual costs of search, retrieval, and reproduction. Please provide itemized breakdown showing actual costs, not estimates or overhead.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Circuit Court Enforcement",
      "statute_citation": "SC Code § 30-4-100(A)",
      "description": "Any citizen of South Carolina may apply to the circuit court for a declaratory judgment, an injunction, or a writ of mandamus to enforce the provisions of FOIA. Suit may be brought in county where public body has principal place of business or where violation alleged to have occurred.",
      "conditions": "Must be South Carolina citizen; venue in county of public body or violation; declaratory judgment, injunction, or mandamus available",
      "applies_to": "FOIA violations in South Carolina",
      "implementation_notes": "Multiple judicial remedies available; flexible venue options; citizenship requirement limits enforcement to SC residents",
      "request_tips": "Warn of judicial option: 'As a South Carolina citizen, SC Code § 30-4-100(A) grants me the right to seek circuit court enforcement through declaratory judgment, injunction, or mandamus.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Attorney Fee Recovery",
      "statute_citation": "SC Code § 30-4-100(B)",
      "description": "The court in its discretion may award reasonable attorney's fees and other costs of litigation to the plaintiff if he substantially prevails. The court may also award fees to defendant if plaintiff's case is frivolous, malicious, or wholly without merit.",
      "conditions": "Discretionary award; plaintiff must substantially prevail; defendant may recover if case frivolous; covers attorney fees and litigation costs",
      "applies_to": "FOIA litigation in South Carolina",
      "implementation_notes": "Fee-shifting makes enforcement financially viable for citizens; two-way fee provision discourages frivolous suits while protecting legitimate claims",
      "request_tips": "When considering litigation: 'SC Code § 30-4-100(B) provides for attorney fee recovery if I substantially prevail. This makes pursuing my rights financially feasible.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "Civil Penalty for Arbitrary Violations",
      "statute_citation": "SC Code § 30-4-100(C)",
      "description": "A public body that arbitrarily and capriciously violates the provisions of FOIA is subject to a civil fine of five hundred dollars for each violation.",
      "conditions": "Requires finding of arbitrary and capricious conduct; $500 fine per violation; applies to public body, not individual officials",
      "applies_to": "Arbitrary and capricious FOIA violations",
      "implementation_notes": "Monetary penalty provides accountability; arbitrary and capricious standard requires more than mere error - willful or unreasonable conduct",
      "request_tips": "Warn of penalties: 'SC Code § 30-4-100(C) imposes $500 civil fines for arbitrary and capricious FOIA violations. Please ensure your decision is supported by law to avoid penalties.'"
    },
    {
      "category": "Enhanced Access Rights",
      "subcategory": "Additive Rights Protection",
      "statute_citation": "SC Code § 30-4-110(B)",
      "description": "The provisions of this chapter are in addition to other provisions of law, and do not limit rights guaranteed by the State Constitution and laws of South Carolina or the United States Constitution and laws.",
      "conditions": "FOIA provides minimum baseline; other constitutional and statutory rights remain available; FOIA does not restrict other access rights",
      "applies_to": "All public records access in South Carolina",
      "implementation_notes": "FOIA is floor, not ceiling - requesters may invoke other constitutional or statutory access rights beyond FOIA; protects against agencies claiming FOIA as sole access mechanism",
      "request_tips": "Assert broader rights: 'SC Code § 30-4-110(B) establishes FOIA as additional to, not limiting, other constitutional and statutory rights. I may assert other access rights beyond FOIA.'"
    },
    {
      "category": "Appeal Rights",
      "subcategory": "One-Year Statute of Limitations",
      "statute_citation": "SC Code § 30-4-165",
      "description": "An action to enforce any provision of this chapter must be commenced within one year after the person knew or should have known of the act or omission alleged to have violated this chapter.",
      "conditions": "One year from knowledge of violation or constructive knowledge; applies to all FOIA enforcement actions",
      "applies_to": "FOIA enforcement litigation",
      "implementation_notes": "Generous one-year window (vs. 60-90 days in many states); runs from knowledge, not violation date; accommodates delayed discovery",
      "request_tips": "Note timeline: 'SC Code § 30-4-165 provides one year from when I knew or should have known of this violation to commence enforcement action. I am evaluating whether to exercise this right.'"
    }
  ]
}
